Repository: tarantool/cartridge-cli
Catalog: doc/locale/*/LC_MESSAGES/doc/installation.po
Languages: ru

source: Installation
ru: Установка

source: Install third-party software:
ru: Для установки Cartridge CLI потребуется стороннее ПО:

source: `Install <https://git-scm.com/book/en/v2/Getting-Started-Installing-Git>`__ ``git``, the version control system.
ru: `Установите <https://git-scm.com/book/en/v2/Getting-Started-Installing-Git>`__ систему управления версиями ``git``.

source: `Install <https://linuxize.com/post/how-to-unzip-files-in-linux/>`__ the ``unzip`` utility.
ru: `Установите <https://linuxize.com/post/how-to-unzip-files-in-linux/>`__ утилиту ``unzip``.

source: `Install <https://gcc.gnu.org/install/>`__ the ``gcc`` compiler.
ru: `Установите <https://gcc.gnu.org/install/>`__ компилятор ``gcc``.

source: `Install <https://cmake.org/install/>`__ the ``cmake`` and ``make`` tools.
ru: `Установите <https://cmake.org/install/>`__ утилиты ``cmake`` и ``make``.

source: Install Tarantool 1.10 or higher:
ru: Установите Tarantool версии 1.10 или выше.

source: You can:
ru: Варианты:

source: `Install it from a package <https://www.tarantool.io/en/download/>`__.
ru: `Установить из пакета <https://www.tarantool.io/en/download/>`__.

source: `Build it from source <https://www.tarantool.io/en/doc/latest/dev_guide/building_from_source/>`__.
ru: `Собрать из исходников <https://www.tarantool.io/en/doc/latest/dev_guide/building_from_source/>`__.

source: [For all platforms except macOS] If you build Tarantool from source, you need to set up the Tarantool packages repository manually:
ru: [На всех платформах, кроме macOS] Если вы собираете Tarantool из исходников, укажите репозиторий пакетов Tarantool вручную.

source: Install the ``cartridge-cli`` package:
ru: Установите пакет ``cartridge-cli``.

source: For CentOS, Fedora, ALT Linux (RPM package):
ru: Если у вас CentOS, Fedora или ALT Linux, установите RPM-пакет:

source: For Debian, Ubuntu (DEB package):
ru: Если у вас Debian или Ubuntu, установите DEB-пакет:

source: For MacOS X (Homebrew formula):
ru: Если у вас macOS, установите инструмент с помощью Homebrew:

source: Or build locally:
ru: Или соберите ``cartridge-cli`` локально:

source: Check the installation:
ru: Проверьте, что инструмент установлен:

source: Enable shell completion
ru: Автодополнение ввода

source: The ``cartridge-cli`` RPM and DEB packages contain a Bash completion script,
ru: В RPM- и DEB-пакетах ``cartridge-cli`` содержится скрипт автодополнения для командной строки Bash ---

source: To enable completion after ``cartridge-cli`` installation, open a new shell or source the completion file at ``/etc/bash_completion.d/cartridge``. Make sure that you have ``bash-completion`` installed.
ru: После установки ``cartridge-cli`` вы можете включить автодополнение. Для этого откройте новый терминал или выполните файл ``/etc/bash_completion.d/cartridge`` командой ``source``. Убедитесь, что у вас установлен пакет автодополнения ``bash-completion``.

source: To install Zsh completion, run:
ru: Чтобы установить механизм автодополнения для Zsh, введите следующую команду:

source: Now enable shell completion:
ru: Теперь включите автодополнение:

source: If you install ``cartridge-cli`` from ``brew``, it automatically installs both Bash and Zsh completion.
ru: Установка ``cartridge-cli`` с помощью команды ``brew`` автоматически включает автодополнение ввода как в Bash, так и в Zsh.
