Repository: tarantool/cartridge-cli
Catalog: doc/locale/*/LC_MESSAGES/doc/instance-paths.po
Languages: ru

source: Application instance paths
ru: Пути к файлам экземпляров

source: The commands that operate with running instances compute instance file paths. Default paths are passed to every instance on start. Other commands use them to communicate with the instance -- for example, to show the logs or connect to the instance through its console socket.
ru: Обращаясь к запущенным экземплярам, команды вычисляют пути к файлам, связанным с этими экземплярами. Такие пути определяются для каждого экземпляра при его запуске. Они необходимы, например, для просмотра журналов или подключения к экземпляру через сокет консоли (console socket).

source: Path configuration file
ru: Файл конфигурации путей

source: The file ``.cartridge.yml``, located in the application root directory, lets you override default paths for a locally running application. Instead of indicating default paths with flags, you can do so by defining values for similarly named keys in ``.cartridge.yml``.
ru: В корневой директории приложения находится файл ``.cartridge.yml``. Он позволяет переопределять пути для локально запущенных экземпляров. Вместо того, чтобы указывать пути через параметры команды, вы можете прописать соответствующее значение в файле ``.cartridge.yml``.

source: For example, instead of
ru: Например, вместо того, чтобы запускать такую команду:

source: you can write the following in your ``.cartridge.yml``:
ru: вы можете записать в файл ``.cartridge.yml`` следующее:

source: In ``.cartridge.yml``, you can also enable or disable the ``stateboard`` parameter. It is initially set to ``true`` in the template application.
ru: В файле ``.cartridge.yml`` можно включить или отключить параметр ``stateboard``. В приложении, созданном по шаблону, этому параметру присвоено значение ``true``.

source: Directory paths
ru: Пути к директориям

source: Run directory
ru: Директория запуска (run-dir)

source: The run directory (``--run-dir``) is where PID and socket files are stored. More specifically, it contains:
ru: В директории запуска (``--run-dir``) хранятся следующие файлы:

source: Instance PID files: ``<run-dir>/<app-name>.<instance-name>.pid``
ru: PID-файлы экземпляров --- ``<run-dir>/<имя_приложения>.<имя_экземпляра>.pid``.

source: Instance console sockets: ``<run-dir>/<app-name>.<instance-name>.control``
ru: Сокеты консоли (console sockets) экземпляров --- ``<run-dir>/<имя_приложения>.<имя_экземпляра>.control``.

source: Instance notify sockets: ``<run-dir>/<app-name>.<instance-name>.notify``.
ru: Notify-сокеты экземпляров --- ``<run-dir>/<имя_приложения>.<имя_экземпляра>.pid``.

source: Data directory
ru: Директория для данных (data-dir)

source: The data directory (``--data-dir``) contains the instances' working directories.
ru: В директории для данных (``--data-dir``) находятся рабочие директории экземпляров.

source: Each instance's working directory is ``<data-dir>/<app-name>.<instance-name>``.
ru: Рабочая директория каждого экземпляра имеет следующий путь: ``<data-dir>/<имя_приложения>.<имя_экземпляра>``.

source: Logs directory
ru: Директория для журналов (log-dir)

source: The logs directory (``--log-dir``) is where instance logs are stored when the instances run in the background. This directory is created on ``cartridge start -d`` and can be used by ``cartridge log``.
ru: В директории журналов (``--log-dir``) хранятся журналы экземпляров, работающих в фоновом режиме. Директория создается командой ``cartridge start -d`` и используется командой ``cartridge log``.

source: Each instance's log file is ``<log-dir>/<app-name>.<instance-name>.log``.
ru: Имя файла журнала формируется так: ``<log-dir>/<имя_приложения>.<имя_журнала>.log``.

source: Instance configuration file
ru: Файл конфигурации экземпляра

source: This file (``--cfg``) lets you configure Cartridge instances. The path to the file is passed to all instances as the environment variable ``TARANTOOL_CFG``. See the :ref:`configuration guide <cartridge-config-basic>` for details.
ru: В файле ``--cfg`` можно конфигурировать экземпляры Cartridge. Этот файл передается всем экземплярам через переменную окружения ``TARANTOOL_CFG``. Более подробную информацию см. в :ref:`руководстве по конфигурации <cartridge-config-basic>`.

source: Example:
ru: Пример:
