Repository: tarantool/cartridge-cli
Catalog: doc/locale/*/LC_MESSAGES/doc/commands/admin.po
Languages: ru

source: Running admin functions
ru: Admin-функции

source: Use ``cartridge admin`` to call admin functions provided by the application.
ru: Используя команду ``cartridge admin``, можно вызывать функции администрирования, зарегистрированные с помощью расширения ``admin``.

source: Flags
ru: Параметры

source: Application name (required)
ru: Имя приложения (обязательно)

source: List the available admin functions
ru: Вывод списка доступных admin-функций

source: Display help for an admin function
ru: Вывод справки для admin-функции

source: Name of the instance to connect to
ru: Имя экземпляра, к которому выполняется подключение

source: Address to connect to
ru: Адрес для подключения

source: The directory to place the instance's sockets (defaults to ``/var/run/tarantool``)
ru: Директория для сокетов экземпляра, по умолчанию — ``/var/run/tarantool``

source: ``admin`` also supports :doc:`global flags </book/cartridge/cartridge_cli/global-flags>`.
ru: Команда ``admin`` также поддерживает :doc:`глобальные параметры </book/cartridge/cartridge_cli/global-flags>`.

source: Details
ru: Описание

source: Your application can provide *admin functions*. First, you have to register them using the `admin extension <https://github.com/tarantool/cartridge-cli-extensions/blob/master/doc/admin.md>`_. The example application contains a function named `probe <https://github.com/tarantool/cartridge-cli-extensions/blob/master/doc/admin.md#example>`__, which probes an instance at a specified URI.
ru: Вы можете добавить к приложению собственные *admin-функции*. Для начала зарегистрируйте их с помощью `расширения admin <https://github.com/tarantool/cartridge-cli-extensions/blob/master/doc/admin.md>`_. В шаблонном приложении представлена admin-функция `probe <https://github.com/tarantool/cartridge-cli-extensions/blob/master/doc/admin.md#example>`__, которая проверяет связь с экземпляром по указанному URI.

source: If your function calls ``print``, the message is displayed on ``cartridge admin`` call (since ``cartridge-cli-extensions`` `1.1.0 <https://github.com/tarantool/cartridge-cli-extensions/releases/tag/1.1.0>`_).
ru: Если ваша функция выводит сообщения с помощью ``print``, эти сообщения будут появляться в терминале при вызове функции через ``cartridge admin`` (начиная с ``cartridge-cli-extensions`` `1.1.0 <https://github.com/tarantool/cartridge-cli-extensions/releases/tag/1.1.0>`_).

source: Your admin functions shouldn't accept arguments with names that conflict with ``cartridge admin`` option names:
ru: Admin-функции вашего приложения не должны принимать аргументы, имена которых могут вызвать конфликт с именами параметров ``cartridge admin``:

source: Connecting to an instance
ru: Подключение к экземпляру

source: When the ``--conn`` flag is specified, CLI connects to the address provided.
ru: Если указан параметр ``--conn``, CLI подключается по заданному адресу.

source: When the ``--instance`` flag is specified, CLI checks if the socket ``<run-dir>/<name>.<instance>.control`` is *available* and if so, uses it to run the admin command. Otherwise, CLI checks all ``<run-dir>/<name>.*.control`` sockets and uses the first *available* socket to run an admin command.
ru: Если указан параметр ``--instance``, CLI в первую очередь проверяет, *доступен* ли сокет ``<run-dir>/<имя>.<экземпляр>.control``. Если сокет доступен, admin-функция вызывается через него. В противном случае CLI проверяет все сокеты ``<run-dir>/<имя>.*.control`` и использует для вызова функции первый *доступный* сокет.

source: An *available* socket is one that can be connected to. For more insight into the search for an available socket, use the ``--verbose`` flag.
ru: Под *доступным* подразумевается сокет, к которому можно выполнить подключение. Чтобы увидеть подробную информацию о поиске доступного сокета, используйте параметр ``--verbose``.

source: Example
ru: Пример

source: This example shows how to use the example admin function, `probe <https://github.com/tarantool/cartridge-cli-extensions/blob/master/doc/admin.md#example>`__.
ru: Ознакомьтесь с `примером использования функции probe <https://github.com/tarantool/cartridge-cli-extensions/blob/master/doc/admin.md#example>`__, включенной в шаблонное приложение.

source: Get functions help
ru: Вывод справочной информации

source: Get a list of available admin functions:
ru: Чтобы вывести список доступных admin-функций, выполните следующую команду:

source: Get help for a specific function:
ru: Чтобы вывести справку по отдельной функции, выполните следующую команду:

source: Call an admin function
ru: Вызов admin-функции

source: Call a function with an argument:
ru: Пример вызова функции с аргументом:
