Repository: tarantool/cartridge-cli
Catalog: doc/locale/*/LC_MESSAGES/doc/commands/build.po
Languages: ru

source: Building your application locally
ru: Локальная сборка приложения

source: To build your application locally (for local testing), run this in any directory:
ru: Чтобы собрать приложение локально (например, для локального тестирования), в любой директории выполните следующую команду:

source: Flags
ru: Параметры

source: Path to a custom ``.rockspec`` file that you want use for the current build.
ru: Путь к пользовательскому файлу ``.rockspec``, который будет использоваться в текущей сборке.

source: If you run ``cartridge build`` without the ``--spec`` flag, your application directory must contain a ``.rockspec``. The file is already in that directory if you created your app from the default template.
ru: Если вы выполняете команду ``cartridge build`` без параметра ``--spec``, в директории приложения должен находиться файл ``.rockspec``. В директории приложения, созданного по шаблону, этот файл уже есть.

source: ``build`` also supports :doc:`global flags </book/cartridge/cartridge_cli/global-flags>`. The ``--quiet`` flag is particularly convenient when building an application.
ru: Команда ``build`` также поддерживает :doc:`глобальные параметры </book/cartridge/cartridge_cli/global-flags>`. Особенно удобно при сборке приложения использовать параметр ``--quiet``.

source: Details
ru: Описание

source: The command requires one argument---the path to your application directory (that is, to the build source). The default path is ``.`` (current directory).
ru: Команда принимает один обязательный аргумент --- путь к директории вашего приложения, то есть к исходникам для сборки. Путь по умолчанию --- ``.`` (текущая директория).

source: ``cartridge build`` runs:
ru: Команда ``cartridge build`` включает два этапа:

source: ``./cartridge.pre-build`` (if this file exists in the application root directory)
ru: ``./cartridge.pre-build`` (если такой файл есть в корневой директории приложения)

source: During step 2---the key step here---``cartridge`` installs all dependencies specified in the ``.rockspec`` file.
ru: Выполнение второй команды --- ключевая часть процесса. В это время Cartridge устанавливает все зависимости, указанные в файле ``.rockspec``.

source: If your application depends on closed-source rocks, or if the build should contain rocks from a project added as a submodule, **install** all these dependencies **before** calling ``tarantoolctl rocks make``. You can do so using a special file, ``cartridge.pre-build``, which has to be located in your application directory. If you created your application from template, the directory already contains the file.
ru: Если в числе зависимостей вашего приложения есть сторонние модули с закрытым исходным кодом или сборка должна включать модули из проекта, добавленного в виде вложенного модуля, необходимо **установить** все зависимости **до** вызова ``tarantoolctl rocks make``. Это можно сделать с помощью файла ``cartridge.pre-build``, помещенного в директорию приложения. В директории приложения, созданного по шаблону, этот файл уже есть.

source: In ``cartridge.pre-build``, specify all the rocks to build from submodules. For example, add the following line:
ru: В файле ``cartridge.pre-build`` укажите все сторонние модули, которые необходимо собрать из вложенных модулей. Например, добавьте такую строку:

source: To learn more, read about :doc:`pre-build and post-build scripts </book/cartridge/cartridge_cli/pre-post-build>`.
ru: Подробную информацию вы найдете в :doc:`описании скриптов pre-build и post-build </book/cartridge/cartridge_cli/pre-post-build>`.

source: The fully built application will appear in the ``.rocks`` directory. You can start it locally from your application directory.
ru: По завершении сборки приложение появится в директории ``.rocks``. Его можно запустить локально из его корневой директории.

source: Instead of using the pre-build script, you can define the build logic by including ``cmake`` commands in your ``.rockspec``, `like we do it in Cartridge <https://github.com/tarantool/cartridge/blob/master/cartridge-scm-1.rockspec#L26>`_.
ru: Если вы не хотите использовать скрипт ``cartridge.pre-build``, вы можете описать логику сборки, включив команды ``cmake`` в файл ``.rockspec``, `как это сделано в Cartridge <https://github.com/tarantool/cartridge/blob/master/cartridge-scm-1.rockspec#L26>`_.
