Repository: tarantool/cartridge-cli
Catalog: doc/locale/*/LC_MESSAGES/doc/commands/clean.po
Languages: ru

source: Cleaning up instance files
ru: Удаление файлов экземпляра

source: Locally running instances create a number of files, such as the log file, the workdir, the console socket, the PID file, and the notify socket. To remove all of these files for one or more instances, use the ``clean`` command:
ru: Локально запущенные экземпляры создают множество файлов, а именно: файл журнала, workdir, сокет консоли, файл PID и notify-сокет. Чтобы удалить все эти файлы, созданные одним экземпляром или несколькими, используйте команду ``clean``.

source: where ``[INSTANCE_NAME...]`` means that more than one instance name can be specified.
ru: Здесь ``[ИМЯ_ЭКЗЕМПЛЯРА...]`` означает, что можно указать больше одного имени.

source: If no ``INSTANCE_NAME`` is provided, all the instances from the Cartridge instance configuration file are taken as arguments. See the ``--cfg`` option below.
ru: Если не указать ``ИМЯ_ЭКЗЕМПЛЯРА``, в список аргументов войдут все экземпляры из файла конфигурации экземпляра Cartridge. См. параметр ``--cfg`` ниже.

source: Flags
ru: Параметры

source: Remove the stateboard files as well as the files of other instances. Ignored if ``--stateboard-only`` is specified.
ru: Удаление файлов stateboard в числе прочих файлов экземпляров. Игнорируется, если задать параметр ``--stateboard-only``.

source: Remove only the application stateboard files. If this flag is specified, ``INSTANCE_NAME...`` is ignored.
ru: Удаление только файлов stateboard. Если этот параметр указан, ``ИМЯ_ЭКЗЕМПЛЯРА...`` игнорируется.

source: The directory where PID and socket files are stored. Defaults to ``./tmp/run``. ``run-dir`` is also a section of ``.cartridge.yml``. Learn more about :doc:`instance paths </book/cartridge/cartridge_cli/instance-paths>`.
ru: Директория, в которой хранятся PID-файлы и файлы сокетов (по умолчанию ``./tmp/run``). Кроме того, ``run-dir`` --- это раздел в файле ``.cartridge.yml``. Подробную информацию вы найдете в :doc:`описании путей к файлам экземпляров </book/cartridge/cartridge_cli/instance-paths>`.

source: The directory containing the working directories of instances. Defaults to ``./tmp/data``. ``data-dir`` is also a section of ``.cartridge.yml``. Learn more about :doc:`instance paths </book/cartridge/cartridge_cli/instance-paths>`.
ru: Директория, в которой находятся рабочие директории экземпляров (по умолчанию ``./tmp/data``). Кроме того, ``data-dir`` --- это раздел в файле ``.cartridge.yml``. Подробную информацию вы найдете в :doc:`описании путей к файлам экземпляров </book/cartridge/cartridge_cli/instance-paths>`.

source: The directory that stores logs for instances that are running in the background. Defaults to ``./tmp/log``. ``log-dir`` is also a section of ``.cartridge.yml``. Learn more about :doc:`instance paths </book/cartridge/cartridge_cli/instance-paths>`.
ru: Директория, в которой хранятся файлы журналов (по умолчанию ``./tmp/log``). Кроме того, ``log-dir`` --- это раздел в файле ``.cartridge.yml``. Подробную информацию вы найдете в :doc:`описании путей к файлам экземпляров </book/cartridge/cartridge_cli/instance-paths>`.

source: Path to the Cartridge instances configuration file. Defaults to ``./instances.yml``. ``cfg``is also a section of ``.cartridge.yml``. Learn more about :doc:`instance paths </book/cartridge/cartridge_cli/instance-paths>`.
ru: Путь к файлу конфигурации экземпляров (по умолчанию ``./instances.yml``). Кроме того, ``cfg`` --- это раздел в файле ``.cartridge.yml``. Подробную информацию вы найдете в :doc:`описании путей, определяемых для экземпляров </book/cartridge/cartridge_cli/instance-paths>`.

source: ``clean`` also supports :doc:`global flags </book/cartridge/cartridge_cli/global-flags>`.
ru: Команда ``clean`` также поддерживает :doc:`глобальные параметры </book/cartridge/cartridge_cli/global-flags>`.
