Repository: tarantool/cartridge-cli
Catalog: doc/locale/*/LC_MESSAGES/doc/commands/create.po
Languages: ru

source: Creating an application from template
ru: Создание приложения по шаблону

source: To create an application from a Cartridge template, run this in any directory:
ru: Чтобы создать приложение по шаблону, в любой директории выполните следующую команду:

source: Flags
ru: Параметры

source: Application name.
ru: Имя приложения.

source: Path to the application template. See details below.
ru: Путь к шаблону приложения (см. ниже).

source: Name of the application template. Currently, only the ``cartridge`` template is supported.
ru: Имя шаблона приложения. В настоящее время поддерживается только шаблон ``cartridge``.

source: ``create`` also supports :doc:`global flags </book/cartridge/cartridge_cli/global-flags>`.
ru: Команда ``create`` также поддерживает :doc:`глобальные параметры </book/cartridge/cartridge_cli/global-flags>`.

source: Details
ru: Описание

source: Your application will appear in the ``<path>/<app-name>/`` directory.
ru: Приложение создается в директории ``<путь>/<имя-приложения>/``.

source: The template used by default is ``cartridge``. It produces a simple Cartridge application that includes:
ru: Несложное приложение на основе шаблона по умолчанию ``cartridge`` содержит следующие компоненты:

source: One custom role with an HTTP endpoint.
ru: Пользовательскую роль с конечной точкой для HTTP-запросов.

source: Sample tests and basic test helpers.
ru: Примеры тестов и базовые утилиты для тестирования.

source: Development files like ``.luacheckrc``.
ru: Файлы для разработки, такие как ``.luacheckrc``.

source: If you have ``git`` installed, a Git repository with a ``.gitignore`` file will be also set up in the project root directory. The initial commit will be created and tagged with the application :ref:`version <cartridge-versioning>`.
ru: Если у вас установлен ``git``, в корневой директории проекта создается Git-репозиторий с файлом ``.gitignore``. Сразу формируется первоначальный коммит с тегом :ref:`версии <cartridge-versioning>` приложения.

source: Project directory
ru: Директория проекта

source: Let's take a closer look at the files inside the ``<app_name>/`` directory:
ru: В директории ``<имя_приложения>/`` находится несколько групп файлов.

source: Application files:
ru: Файлы приложения:

source: ``app/roles/custom-role.lua``: a sample :ref:`custom role <cartridge-roles>` with a simple HTTP API. Can be enabled as ``app.roles.custom``.
ru: ``app/roles/custom-role.lua`` --- пример :ref:`кластерной роли <cartridge-roles>` с простым HTTP API. Эту роль можно включить, передав ее как ``app.roles.custom``.

source: ``<app_name>-scm-1.rockspec``: contains application dependencies.
ru: ``<имя_приложения>-scm-1.rockspec`` --- файл, содержащий зависимости приложения.

source: ``init.lua``: application entry point.
ru: ``init.lua`` --- точка входа в приложение.

source: ``stateboard.init.lua`` application :doc:`stateboard </book/cartridge/cartridge_cli/commands/failover>` entry point.
ru: ``stateboard.init.lua`` --- точка входа в :doc:`экземпляр stateboard </book/cartridge/cartridge_cli/commands/failover>` приложения.

source: Build and packaging files:
ru: Файлы, необходимые для сборки и упаковки:

source: To learn more, check the documentation on :doc:`pre-build and post-build scripts <../pre-post-build>`, :doc:`building your application with Docker <pack/building-in-docker>`, and :doc:`creating a Docker image of your application <pack/docker>`.
ru: Подробную информацию вы найдете в документации по :doc:`скриптам pre-build и post-build <../pre-post-build>`, :doc:`сборке приложения с помощью Docker <pack/building-in-docker>` и :doc:`созданию Docker-образа приложения <pack/docker>`.

source: Development files:
ru: Файлы, необходимые для разработки:

source: ``deps.sh`` resolves dependencies listed in the ``.rockspec`` file and installs test dependencies (like ``luatest``).
ru: ``deps.sh`` решает проблемы с зависимостями из файла ``.rockspec`` и устанавливает зависимости для тестирования (например, ``luatest``).

source: ``instances.yml`` contains the configuration of instances and is used by ``cartridge start``.
ru: ``instances.yml`` содержит конфигурацию экземпляров и используется командой ``cartridge start``.

source: ``.cartridge.yml`` contains the Cartridge configuration and is also used by ``cartridge start``.
ru: ``.cartridge.yml`` содержит конфигурацию Cartridge и используется командой ``cartridge start``.

source: ``systemd-unit-params.yml`` contains systemd parameters.
ru: ``systemd-unit-params.yml`` содержит параметры systemd.

source: ``tmp`` is a directory for temporary files used as a run directory (see ``.cartridge.yml``).
ru: ``tmp`` --- директория для временных файлов, выступающая в качестве директории запуска (см. ``.cartridge.yml``).

source: ``.git`` is the directory responsible for the Git repository.
ru: ``.git`` --- директория Git-репозитория.

source: ``.gitignore`` is a file where you can specify the files for Git to ignore.
ru: В файле ``.gitignore`` можно указать файлы, игнорируемые Git.

source: Test files (with sample tests):
ru: Файлы, необходимые для тестирования, и примеры тестов:

source: Configuration files:
ru: Файлы конфигурации:

source: Using a custom template
ru: Работа с пользовательскими шаблонами

source: By default, ``create`` uses a standard template named ``cartridge``. However, you can also make a custom template. To create an application from it, run ``cartridge create`` with the ``--from`` flag, specifying the path to your template.
ru: По умолчанию команда ``create`` задействует стандартный шаблон под названием ``cartridge``. Вы также можете использовать собственный шаблон. Чтобы создать по нему приложение, передайте в команде ``cartridge create`` параметр ``--from``, указав в качестве аргумента путь к своему шаблону.

source: If the template directory is a Git repository, all files in the ``.git`` directory will be ignored upon instantiating the template. Instead, a new git repo will be initialized for the newly created application.
ru: Если шаблон находится в Git-репозитории, при создании приложения по этому шаблону все файлы в директории ``.git`` игнорируются. Вместо этого для нового приложения создается новый Git-репозиторий.

source: Don't include the ``.rocks`` directory in your template application. To specify application dependencies, use the ``.rockspec`` and ``cartridge.pre-build`` files.
ru: Чтобы задать зависимости для приложения, не следует создавать директорию ``.rocks`` в своем шаблоне --- используйте файлы ``.rockspec`` и ``cartridge.pre-build``.

source: Text variables
ru: Текстовые переменные

source: Filenames and content can contain `text templates <https://golang.org/pkg/text/template/>`_.
ru: В именах и содержимом файлов можно использовать `текстовые переменные <https://golang.org/pkg/text/template/>`_.

source: You can use the following variables:
ru: Доступны следующие переменные:

source: ``Name``: application name.
ru: ``Name`` --- имя приложения.

source: ``StateboardName``: application stateboard name (``<app-name>-stateboard``).
ru: ``StateboardName`` --- имя экземпляра stateboard (``<имя_приложения>-stateboard``).

source: ``Path``: absolute path to the application.
ru: ``Path`` --- абсолютный путь к приложению.

source: For example:
ru: Пример:
