Repository: tarantool/cartridge-cli
Catalog: doc/locale/*/LC_MESSAGES/doc/commands/failover.po
Languages: ru

source: Configuring Cartridge failover
ru: Настройка восстановления после отказа в Cartridge CLI

source: The ``cartridge failover`` command lets you configure Cartridge failover.
ru: Конфигурировать восстановление после отказа (failover) в Cartridge можно с помощью команды ``cartridge failover``.

source: Flags
ru: Параметры

source: Application name.
ru: Имя приложения.

source: Path to the file containing failover settings. Defaults to ``failover.yml``.
ru: Путь к файлу с настройками восстановления после отказа. По умолчанию --- ``failover.yml``.

source: ``failover`` also supports :doc:`global flags </book/cartridge/cartridge_cli/global-flags>`.
ru: Команда ``failover`` также поддерживает :doc:`глобальные параметры </book/cartridge/cartridge_cli/global-flags>`.

source: Details
ru: Описание

source: Failover is configured through the Cartridge Lua API.
ru: Восстановление после отказа конфигурируется с помощью Lua API.

source: To run the failover, ``cartridge-cli`` connects to a random configured instance, so you must have a topology configured. To learn more, see the :doc:`cartridge replicasets </book/cartridge/cartridge_cli/commands/replicasets>` command. You might also want to check out the documentation on :ref:`Cartridge failover architecture <cartridge-failover>`.
ru: Чтобы запустить восстановление после отказа, ``cartridge-cli`` подключается к случайно выбранному сконфигурированному экземпляру. Поэтому предварительно следует настроить топологию кластера. Подробную информацию об этом вы найдете в описании команды :doc:`cartridge replicasets </book/cartridge/cartridge_cli/commands/replicasets>`. Кроме того, вы можете обратиться к документации по :ref:`архитектуре восстановления после отказа <cartridge-failover>`.

source: You can manage failover in the following ways:
ru: Управлять восстановлением после отказа можно так:

source: :ref:`Set a specific failover mode <cartridge-cli_failover-set>` with ``cartridge failover set``, passing the parameters via special flags.
ru: :ref:`Задать режим восстановления после отказа <cartridge-cli_failover-set>`, передав нужные параметры в команде ``cartridge failover set``.

source: Specify parameters through a :ref:`configuration file <cartridge-cli_failover-setup>` and make it the default file with ``cartridge failover setup``.
ru: Указать параметры в :ref:`файле конфигурации <cartridge-cli_failover-setup>` и задать его в качестве настройки по умолчанию командой ``cartridge failover setup``.

source: :ref:`Check failover status <cartridge-cli_failover-status>` with ``status``.
ru: :ref:`Проверить статус восстановления после отказа <cartridge-cli_failover-status>` с помощью команды ``status``.

source: :ref:`Disable failover <cartridge-cli_failover-disable>` with ``disable``.
ru: :ref:`Отключить восстановление после отказа <cartridge-cli_failover-disable>` с помощью команды ``disable``.

source: Subcommands
ru: Подкоманды

source: This command lets you set a failover mode. Learn more about :ref:`Cartridge failover modes <cartridge-failover>`.
ru: С помощью этой команды можно задать режим восстановления после отказа. Подробную информацию вы найдете в документации о :ref:`режимах восстановления после отказа <cartridge-failover>`.

source: Modes
ru: Режимы

source: Failover state provider. Can be ``stateboard`` or ``etcd2``. Used only in the ``stateful`` mode.
ru: Поставщик состояния при восстановлении после отказа. Возможные значения: ``stateboard`` или ``etcd2``. Используется только в режиме ``stateful``.

source: Failover parameters. Described in a JSON-formatted string like ``"{'fencing_timeout': 10', 'fencing_enabled': true}"``.
ru: Параметры восстановления после отказа, описанные в виде строки в формате JSON. Пример: ``"{'fencing_timeout': 10', 'fencing_enabled': true}"``.

source: Failover provider parameters. Described in a JSON-formatted string like ``"{'lock_delay': 14}"``.
ru: Параметры поставщика состояния, описанные в виде строки в формате JSON. Пример: ``"{'lock_delay': 14}"``.

source: To learn more about the parameters, check the corresponding :ref:`section of this document <cartridge-cli_failover-parameters>`.
ru: Информацию о параметрах вы найдете в соответствующем :ref:`разделе руководства <cartridge-cli_failover-parameters>`.

source: Unlike in the case with ``setup``, don't pass unnecessary parameters. For example, don't specify the ``--state-provider`` flag when the mode is ``eventual``, otherwise you will get an error.
ru: В отличие от команды ``setup``, ``set`` не принимает параметры, неподходящие для выбранного режима. Например, если указать параметр ``--state-provider`` для режима ``eventual``, произойдет ошибка.

source: The failover configuration file defaults to ``failover.yml``. See the :ref:`full description of parameters <cartridge-cli_failover-parameters>` to include in the failover configuration.
ru: По умолчанию для конфигурации восстановления после отказа используется файл ``failover.yml``. См. :ref:`описание параметров <cartridge-cli_failover-parameters>`, используемых в этой конфигурации.

source: Example
ru: Пример

source: You can leave extra parameters in the file, which may be convenient. Suppose you have ``stateful etcd2`` failover configured and want to change it to ``stateful stateboard``. You don't have to delete ``etcd2_params`` from the file, but you can just add ``stateboard_params`` and change the ``state_provider``. Then you might want to switch the failover to the ``eventual`` mode. This doesn't require removing ``etcd2_params`` or ``stateboard_params`` from the configuration file either.
ru: В файле можно сохранять неиспользуемые параметры. Допустим, задан режим ``stateful`` и информацию о состоянии передает поставщик ``etcd2``, а вы хотите указать вместо этого поставщика ``stateboard``. Вы можете не удалять из файла раздел ``etcd2_params`` --- достаточно добавить ``stateboard_params`` и изменить значение ``state_provider``. Чтобы впоследствии перевести восстановление после отказа в режим ``eventual``, не обязательно удалять из файла ни ``etcd2_params``, ни ``stateboard_params``.

source: However, be careful: all the parameters described in the configuration file will be applied on the Cartridge side. Thus, ``etcd2_params`` and ``stateboard_params`` from the example above will still be applied in the ``eventual`` mode, although they are intended for use with the ``stateful`` mode.
ru: Обратите внимание, что в Cartridge применяются все параметры, указанные в файле конфигурации. Это означает, что в примере выше параметры ``etcd2_params`` и ``stateboard_params`` будут применены и для режима ``eventual``, хотя они предназначены для режима ``stateful``.

source: Checks failover status.
ru: Проверка статуса восстановления после отказа.

source: Disables failover. Another way to disable failover is to specify the ``disabled`` mode with :ref:`set <cartridge-cli_failover-set>` or in the :ref:`configuration file <cartridge-cli_failover-setup>` (see above).
ru: Отключение восстановления после отказа. Другой способ отключить его --- задать режим ``disabled`` с помощью команды :ref:`set <cartridge-cli_failover-set>` или в :ref:`файле конфигурации <cartridge-cli_failover-setup>`.

source: Failover parameters
ru: Параметры восстановления после отказа

source: (Required) Failover mode. Possible values: ``disabled``, ``eventual``, ``stateful``.
ru: Режим восстановления после отказа (обязательный параметр). Возможные значения: ``disabled``, ``eventual``, ``stateful``.

source: Timeout in seconds used by membership to mark suspect members as dead.
ru: Время в секундах до перевода экземпляра в кластере из статуса ``suspect`` в статус ``dead``.

source: Abandon leadership when both the state provider quorum and at least one replica are lost. Works for ``stateful`` mode only.
ru: Сброс статуса лидера, если потерян кворум поставщиков состояний и хотя бы одна реплика (только для режима ``stateful``).

source: Time in seconds to actuate fencing after the check fails.
ru: Время до срабатывания фенсинга после неудачной проверки.

source: Period in seconds to perform the check.
ru: Время в секундах до выполнения проверки.

source: Other parameters are mode-specific.
ru: Остальные параметры связаны с выбранным режимом.

source: Eventual failover
ru: Режим eventual

source: If the ``eventual`` mode is specified, no additional parameters are required.
ru: В режиме ``eventual`` не требуется указывать дополнительные параметры.

source: Read the :ref:`documentation <cartridge-failover>` to learn more about ``eventual`` failover.
ru: Подробную информацию о восстановлении после отказа в режиме ``eventual`` вы найдете в :ref:`документации <cartridge-failover>`.

source: Stateful failover
ru: Режим stateful

source: ``stateful`` failover requires the following parameters:
ru: Восстановление после отказа в режиме ``stateful`` требует следующих параметров:

source: External state provider type. Supported providers: ``stateboard``, ``etcd2``.
ru: Тип поставщика внешнего состояния. Поддерживаются следующие варианты: ``stateboard``, ``etcd2``.

source: Stateboard configuration:
ru: Конфигурация экземпляра stateboard:

source: ``uri`` (required): Stateboard instance URI.
ru: ``uri`` --- URI экземпляра stateboard (обязательный параметр).

source: ``password`` (required): Stateboard instance password.
ru: ``password`` --- пароль к экземпляру stateboard (обязательный параметр).

source: Configuration for etcd2:
ru: Конфигурация ``etcd2``:

source: ``prefix``: Prefix for etcd keys (<prefix>/lock and <prefix>/leaders).
ru: ``prefix`` --- префикс ключей etcd (``<prefix>/lock``, ``<prefix>/leaders``).

source: ``lock_delay``: Timeout in seconds. Defines the lock's time-to-live. Default value in Cartridge is ``10``.
ru: ``lock_delay`` --- длительность блокировки в секундах. По умолчанию в Cartridge --- ``10``.

source: ``endpoints``: URIs used to discover and access etcd cluster instances. Default value in Cartridge is ``['http://localhost:2379', 'http://localhost:4001']``.
ru: ``endpoints`` --- URI для поиска экземпляров etcd и подключения к ним. По умолчанию в Cartridge --- ``['http://localhost:2379', 'http://localhost:4001']``.

source: Read the :ref:`documentation <cartridge-failover>` to learn more about ``stateful`` failover.
ru: Подробную информацию о восстановлении после отказа в режиме ``stateful`` вы найдете в соответствующей :ref:`документации <cartridge-failover>`.
