Repository: tarantool/cartridge-cli
Catalog: doc/locale/*/LC_MESSAGES/doc/commands/log.po
Languages: ru

source: Get instance logs
ru: Получение журналов экземпляра

source: To get the logs of an instance running in the background, use the ``log`` command:
ru: Чтобы получить журналы экземпляра, работающего в фоновом режиме, воспользуйтесь командой ``log``:

source: which means that more than one instance name can be specified.
ru: Здесь ``[ИМЯ_ЭКЗЕМПЛЯРА...]`` означает, что можно указать больше одного имени.

source: Options
ru: Параметры

source: Output appended data as the log grows.
ru: Вывод данных по мере их добавления в журнал.

source: Number of last lines to be displayed. Defaults to 15.
ru: Количество последних строк файла журнала, которые необходимо вывести на экран. По умолчанию --- 15.

source: Get both stateboard and instance logs. Ignored if ``--stateboard-only`` is specified.
ru: Получение журналов экземпляра stateboard наряду с журналами других экземпляров. Игнорируется, если задать параметр ``--stateboard-only``.

source: Get only stateboard logs. If specified, ``INSTANCE_NAME...`` is ignored.
ru: Получение только журналов экземпляра stateboard. Если задать этот параметр, ``ИМЯ_ЭКЗЕМПЛЯРА...`` игнорируется.

source: The directory that stores logs for instances that are running in the background. Defaults to ``./tmp/log``. ``log-dir`` is also a section of ``.cartridge.yml``. Learn more about :doc:`instance paths </book/cartridge/cartridge_cli/instance-paths>`.
ru: Директория, где хранятся файлы журналов (по умолчанию ``./tmp/log``). ``log-dir`` --- также раздел файла ``.cartridge.yml``. Узнайте больше о :doc:`путях к файлам экземпляров </book/cartridge/cartridge_cli/instance-paths>`.

source: The directory where PID and socket files are stored. Defaults to ``./tmp/run``. ``run-dir`` is also a section of ``.cartridge.yml``. Learn more about :doc:`instance paths </book/cartridge/cartridge_cli/instance-paths>`.
ru: Директория, где хранятся PID-файлы и файлы сокетов (по умолчанию ``./tmp/run``). ``run-dir`` --- также раздел файла ``.cartridge.yml``. Узнайте больше о :doc:`путях к файлам экземпляров </book/cartridge/cartridge_cli/instance-paths>`.

source: Path to the Cartridge instances configuration file. Defaults to ``./instances.yml``. ``cfg``is also a section of ``.cartridge.yml``. Learn more about :doc:`instance paths </book/cartridge/cartridge_cli/instance-paths>`.
ru: Путь к файлу конфигурации экземпляров (по умолчанию ``./instances.yml``). ``cfg`` --- также раздел файла ``.cartridge.yml``. Узнайте больше о :doc:`путях к файлам экземпляров </book/cartridge/cartridge_cli/instance-paths>`.

source: ``log`` also supports :doc:`global flags </book/cartridge/cartridge_cli/global-flags>`.
ru: Команда ``log`` также поддерживает :doc:`глобальные параметры </book/cartridge/cartridge_cli/global-flags>`.

source: Use the exact same ``log-dir`` as you did with ``cartridge start``. The logs are retrieved from the files stored in that directory.
ru: Используйте ту же директорию ``log-dir``, что и в команде ``cartridge start``. Журналы загружаются из файлов, хранящихся в этой директории.
