Repository: tarantool/cartridge-cli
Catalog: doc/locale/*/LC_MESSAGES/doc/commands/pack.po
Languages: ru

source: Building in Docker
ru: Сборка в Docker

source: Packaging the application
ru: Упаковка приложения

source: To package your application, use the ``pack`` command:
ru: Чтобы упаковать приложение, используйте команду ``pack``:

source: cartridge pack TYPE [PATH] [flags]
ru: cartridge pack TYPE [PATH] [параметры]

source: where:
ru: Передаваемые аргументы:

source: ``TYPE`` (required) is the distribution type. Supported types:
ru: ``TYPE`` (обязательно) --- тип дистрибутива. Поддерживаемые типы:

source: ``PATH`` (optional) is the path to the application directory. Defaults to ``.`` (the current directory).
ru: ``PATH`` (необязательно) --- путь к директории приложения. Значение по умолчанию: ``.`` (текущая директория).

source: Before packaging, ``cartridge pack`` builds the application. This process is similar to what ``cartridge build`` :doc:`does <build>`. The resulting artifact includes ``.rocks`` modules and executables that are specific for the system where you've packaged the application. For this reason, a distribution built on one OS can't be used on another---for example, an RPM built on MacOS can't be installed on a CentOS machine. However, you can work around this by enforcing package build in Docker via the ``--use-docker`` flag.
ru: Перед упаковкой ``cartridge pack`` собирает приложение. Это процесс схож с тем, :doc:`что происходит во время <build>` ``cartridge build``. Итоговый артефакт сборки включает модули ``.rocks`` и исполняемые файлы, специфичные для системы, на которой вы собираете пакет приложения. Именно поэтому дистрибутив, собранный на одной ОС, невозможно использовать на другой: например, RPM-пакет, собранный на MacOS, не может быть установлен на машине с CentOS. Обойти это ограничение можно, выбрав сборку приложения внутри Docker-контейнера с помощью параметра ``--use-docker``.

source: If you use open-source Tarantool, your artifact will have `tarantool` as a dependency. Its version will be the same as in your system's ``PATH``. If you use Tarantool Enterprise, your artifact will contain the ``tarantool`` and ``tarantoolctl`` binaries from your current SDK.
ru: Если вы используете версию Tarantool с открытым исходным кодом, ``tarantool`` будет среди зависимостей вашего артефакта. Версия Tarantool при этом будет совпадать с указанной в переменной ``PATH`` в вашей системе. Если же вы используете Tarantool Enterprise, ваш артефакт будет включать бинарные файлы ``tarantool`` и ``tarantoolctl`` из вашего SDK.

source: Flags
ru: Параметры

source: The following flags control the local packaging of any distribution type, be it RPM, DEB, TGZ, or a Docker image.
ru: Следующие параметры управляют локальной упаковкой приложения в RPM- или DEB-дистрибутив, TGZ-архив или Docker-образ.

source: Application name. The package and the systemd service will have the same name. The default name comes from the ``package`` field in the ``.rockspec`` file.
ru: Имя приложения. Оно будет присвоено и пакету, и соответствующему сервису systemd. По умолчанию имя берется из поля ``package`` в файле ``.rockspec``.

source: Application package version. Expected pattern: ``major.minor.patch[-count][-commit]``. Input like ``major.minor.patch`` will be normalized to ``major.minor.patch-count``. By default, the version string is the output of ``git describe --tags --long``. If the application is not a git repository, you have to set the ``--version`` flag explicitly.
ru: Версия пакета приложения. Ожидаемый шаблон: ``major.minor.patch[-count][-commit]``. Входные данные типа ``major.minor.patch`` будут приведены к виду ``major.minor.patch-count``. По умолчанию строка версии соответствует выводу ``git describe --tags --long``. Если приложение не является Git-репозиторием, необходимо явно установить параметр ``--version``.

source: The suffix of the resulting file or image name. For example, a ``tar.gz`` distribution is named according to the pattern: ``<name>-<version>[-<suffix>].tar.gz``.
ru: Суффикс итогового имени файла или образа. Например, дистрибутив ``tar.gz`` именуется по следующему шаблону: ``<name>-<version>[-<suffix>].tar.gz``.

source: Force Cartridge to build the application in Docker. Enforced if you're building a Docker image.
ru: Принудительная сборка приложения на Cartridge в Docker. Параметр обязателен, если вы собираете Docker-образ.

source: Disable :ref:`path caching <cartridge-cli-path_caching>`. When used with ``cartridge pack docker``, also enforces the ``--no-cache`` ``docker`` flag.
ru: Отключение :ref:`кэширования по путям <cartridge-cli-path_caching>`. При использовании вместе с ``cartridge pack docker`` автоматически устанавливает параметр ``--no-cache`` для команды ``docker``.

source: To learn about distribution-specific flags, check the documentation for creating Cartridge :doc:`RPM/DEB distributables <pack/rpm-deb>` and :doc:`Docker images <pack/docker>`.
ru: Ознакомьтесь с документацией по упаковке приложений на Cartridge в :doc:`RPM/DEB-дистрибутивы <pack/rpm-deb>` и :doc:`Docker-образы <pack/docker>`, чтобы узнать больше о параметрах, специфичных для этих способов упаковки.

source: Details
ru: Описание

source: Building the package
ru: Сборка пакета

source: By default, the package is built inside a temporary directory in ``~/.cartridge/tmp/``. In this way, the packaging process doesn't affect the contents of your application directory.
ru: По умолчанию пакет собирается внутри временной директории в ``~/.cartridge/tmp/``. Таким образом, процесс упаковки не влияет на содержимое директории вашего приложения.

source: When Cartridge copies your application files, it ignores the ``.rocks`` directory.
ru: Копируя файлы приложения, Cartridge игнорирует директорию ``.rocks``.

source: All file permissions are preserved in the resulting package, and the code files owner is set to ``root:root``.
ru: В итоговом пакете сохраняются все права доступа к файлам, а в качестве владельца файлов кода устанавливается ``root:root``.

source: Make sure all your application files have at least ``a+r`` permissions (``a+rx`` for directories). Otherwise, ``cartridge pack`` will raise an error.
ru: Убедитесь, что для всех файлов приложения установлены права доступа не ниже ``a+r`` (``a+rx`` для директорий). В противном случае ``cartridge pack`` выдаст ошибку.

source: Customizing your build directory
ru: Настройка сборочной директории

source: You can specify a custom build directory for your application using the ``CARTRIDGE_TEMPDIR`` environment variable. If this directory doesn't exist, it will be created, used for packaging the application, and then removed.
ru: Указать пользовательскую директорию для сборки приложения можно с помощью переменной окружения ``CARTRIDGE_TEMPDIR``. Если такой директории не существует, она будет создана, использована для упаковки приложения, а затем удалена.

source: If you specify an existing directory in the ``CARTRIDGE_TEMPDIR`` environment variable, the ``CARTRIDGE_TEMPDIR/cartridge.tmp`` directory will be used for packaging the application and then removed. Before the packaging starts, this nested directory will be cleaned up.
ru: Если в переменной окружения ``CARTRIDGE_TEMPDIR`` указать существующую директорию, то приложение будет упаковано в директории ``CARTRIDGE_TEMPDIR/cartridge.tmp``, которая затем будет удалена. Перед началом сборки пакета эта вложенная директория будет очищена.

source: This is especially useful if you want to use your Docker build with GitLab CI. Docker volumes don't work properly with the default tmp directory in this case. Use ``CARTRIDGE_TEMPDIR=. cartridge pack ...``.
ru: Это может быть актуально при сборке Docker-образов с помощью GitLab CI, так как в этом случае Docker-тома (Docker volumes) не работают должным образом с директорией ``tmp`` по умолчанию. Используйте для таких случаев ``CARTRIDGE_TEMPDIR=. cartridge pack ...``.

source: How building works
ru: Как работает сборка

source: This section concern building Cartridge applications locally. To learn about building them in Docker, check the :doc:`corresponding documentation page <pack/building-in-docker>`.
ru: Этот раздел посвящен локальной сборке приложений на Cartridge. Чтобы узнать о сборке в Docker, ознакомьтесь с :doc:`соответствующим разделом документации <pack/building-in-docker>`.

source: Whether you're building a TGZ archive, an RPM/DEB distributable, or a Docker image, your application is built in three stages.
ru: Независимо от того, собираете ли вы TGZ-архив, дистрибутив RPM/DEB или Docker-образ, сборка включает три этапа.

source: Stage 1: Cleaning up the application directory
ru: Этап 1. Очистка директории приложения

source: At this stage, some files are filtered out of the application directory.
ru: На этом этапе из директории приложения удаляется часть файлов.

source: First, ``git clean -X -d -f`` removes all untracked and ignored files (it works for submodules, too).
ru: В первую очередь с помощью ``git clean -X -d -f`` удаляются все неотслеживаемые и игнорируемые файлы, в том числе относящиеся к вложенным модулям.

source: After that, the ``.git`` directory itself is removed.
ru: После этого удаляется директория ``.git``.

source: Stage 2. Building the application
ru: Этап 2. Сборка приложения

source: At this stage, ``cartridge`` runs the following:
ru: На этом этапе ``cartridge`` выполняет следующее:

source: ``./cartridge.pre-build``, if it exists in the application root directory. Learn more about :doc:`pre-build and post-build scripts </book/cartridge/cartridge_cli/pre-post-build>`. Instead of using the pre-build script, you can define the build logic by including ``cmake`` commands in your ``.rockspec``, `like we do it in Cartridge <https://github.com/tarantool/cartridge/blob/master/cartridge-scm-1.rockspec#L26>`_.
ru: Скрипт ``./cartridge.pre-build``, если он есть в корневой директории приложения. Узнайте больше о :doc:`скриптах pre-build и post-build </book/cartridge/cartridge_cli/pre-post-build>`. Вместо того, чтобы использовать этот скрипт, вы можете определить правила сборки, включив в файл ``.rockspec`` команды ``cmake``, `как это сделано в Cartridge <https://github.com/tarantool/cartridge/blob/master/cartridge-scm-1.rockspec#L26>`_.

source: ``tarantoolctl rocks make``. This requires a ``.rockspec`` file in the application root directory. If you created your application from template, the file is already there. ``cartridge`` installs all dependencies specified in that file.
ru: ``tarantoolctl rocks make``. Чтобы выполнить эту команду, потребуется файл ``.rockspec`` в корневой директории приложения. Если вы создали приложение по шаблону, этот файл уже находится там. ``cartridge`` установит все зависимости, указанные в этом файле.

source: As a result, the fully built application will appear in the ``.rocks`` directory. You can start it locally from your application directory.
ru: По завершении сборки приложение появится в директории ``.rocks``. Его можно запустить локально из его корневой директории.

source: Stage 3. Cleaning up the files before packing
ru: Этап 3. Удаление ненужных файлов перед сборкой пакета

source: At this stage, ``cartridge`` runs ``cartridge.post-build``, if it exists. The post-build script removes junk files (like ``node_modules``) generated during application build.
ru: На этом этапе ``cartridge`` запускает ``cartridge.post-build``, если такой скрипт существует. Скрипт post-build удаляет ненужные файлы, созданные во время сборки приложения --- например, ``node_modules``.

source: Learn more about :doc:`pre-build and post-build scripts </book/cartridge/cartridge_cli/pre-post-build>`.
ru: Подробную информацию вы найдете в :doc:`описании скриптов pre-build и post-build </book/cartridge/cartridge_cli/pre-post-build>`.

source: Versioning
ru: Версионирование

source: The package generates ``VERSION.lua``, a file that contains the current version of the project. When you connect to an instance with :doc:`cartridge connect <connect>`, you can check the project version by obtaining information from this file:
ru: При сборке будет автоматически создан файл ``VERSION.lua``, в котором хранится текущая версия приложения. При подключении к экземпляру с помощью :doc:`cartridge connect <connect>` вы сможете проверить версию проекта, получив информацию из этого файла следующим образом:

source: ``VERSION.lua`` is also used when you call :ref:`cartridge.reload_roles() <cartridge.reload_roles>`:
ru: ``VERSION.lua`` также используется при вызове :ref:`cartridge.reload_roles() <cartridge.reload_roles>`:

source: -- Getting the project version require('VERSION') -- Reloading the instances after making some changes to VERSION.lua require('cartridge').reload_roles() -- Getting the updated project version require('VERSION')
ru: -- Получение версии проекта require('VERSION') -- Перезапуск экземпляров после изменения файла VERSION.lua require('cartridge').reload_roles() -- Получение обновленной версии проекта require('VERSION')

source: If ``VERSION.lua`` is already in the application directory, it will be overwritten during packaging.
ru: Если в директории приложения уже есть файл ``VERSION.lua``, при сборке пакета он будет перезаписан.

source: Path caching
ru: Кэширование по путям

source: You can cache paths for packaging Cartridge applications. For example, if you package an application multiple times, the same ``.rocks`` are installed every time over and over. To speed up the repacking process, specify the cached paths in ``pack-cache-config.yml``, a file located in the application root directory.
ru: Вы можете кэшировать директории для упаковки приложений на Cartridge. Если вы собираете пакет для приложения несколько раз, одни и те же модули ``.rocks`` устанавливаются каждый раз заново. Чтобы ускорить процесс переупаковки, укажите пути для кэширования в файле ``pack-cache-config.yml``, расположенном в корневой директории приложения.

source: By default, the ``.rocks`` directory is cached. The standard template's ``pack-cache-config.yml`` contains the path to that directory:
ru: Директория ``.rocks`` кэшируется по умолчанию. Путь к ней указан в стандартной конфигурации ``pack-cache-config.yml``:

source: Make sure you specify the path to ``.rocks`` from the application root directory and provide a cache key. Let's look at the example above:
ru: Убедитесь, что вы указали путь к директории ``.rocks`` из корневой директории приложения и предоставили ключ для кэширования. В примере выше:

source: ``<path-to-myapp>/.rocks`` will be cached depending on the content of ``myapp-scm-1.rockspec``.
ru: директория ``<путь_к_myapp>/.rocks`` будет кэширована в зависимости от содержания ``myapp-scm-1.rockspec``;

source: ``<path-to-myapp>/node_modules`` will always be cached.
ru: директория ``<path-to-myapp>/node_modules`` всегда будет добавляться в кэш.

source: ``<path-to-myapp>/third_party/custom_module`` will be cached depending on ``simple-hash-key``.
ru: директория ``<путь_к_myapp>/third_party/custom_module`` будет кэширована в зависимости от значения ``simple-hash-key``;

source: You can't combine these options. For example, you can't specify ``always-cache`` and ``key-path`` at the same time.
ru: Эти параметры нельзя комбинировать: вы не можете одновременно указать и ``always-cache``, и ``key-path``.

source: One project path can only have one caching key. Suppose you cached ``.rocks`` with a ``.rockspec`` file as ``key-path``. Then you changed the contents of ``.rockspec`` and ran ``cartridge pack``. In this case, the old cache (associated with the old key) for the project's ``.rocks`` directory path will be deleted. After packing, the new ``.rocks`` cache path will be saved with the new key.
ru: У каждого пути в проекте может быть только один ключ кэширования. Предположим, вы кэшировали ``.rocks``, указав файл ``.rockspec`` в качестве ``key-path``. Затем вы изменили содержимое файла ``.rockspec`` и запустили ``cartridge pack``. В этом случае старый кэш директории ``.rocks``, связанный со старым ключом, будет удален. Новый кэш для ``.rocks`` будет сохранен с новым ключом после упаковки.

source: There can be no more than **5** projects in the cache that have cached paths. If the 6th project appears, the oldest existing project is removed from the cache directory. However, this is not the case for cached paths within a single project. You can cache as many paths as you like as long as they are in one project.
ru: В кэше можно хранить не более **5** проектов с путями для кэширования. При добавлении шестого самый старый проект будет удален из директории кэша. Для каждого проекта при этом можно добавлять сколько угодно путей для кэширования.

source: To disable caching, use the ``--no-cache`` flag or remove paths from ``pack-cache-config.yml``. To completely reset the cache, delete the ``~/.cartridge/tmp/cache`` directory.
ru: Чтобы отключить кэширование, используйте параметр ``--no-cache`` или удалите пути из ``pack-cache-config.yml``. Полностью сбросить кэш можно, удалив директорию ``~/.cartridge/tmp/cache``.
