Repository: tarantool/cartridge-cli
Catalog: doc/locale/*/LC_MESSAGES/doc/commands/repair.po
Languages: ru

source: Repairing the cluster
ru: Исправление конфигурации кластера

source: The ``cartridge repair`` command repairs a running application.
ru: Команда ``cartridge repair`` используется для восстановления приложения в процессе работы.

source: Here are several simple rules you need to know before using this command:
ru: Прежде чем применять команду, изучите несколько правил:

source: Do not use ``repair`` if you aren't sure that it's exactly what you need.
ru: Используйте ``repair``, только если вы уверены, что это необходимо.

source: Always run ``repair`` with the ``--dry-run`` flag first.
ru: Всегда предварительно вызывайте ``repair`` с параметром ``--dry-run``.

source: Do not hesitate to use the ``--verbose`` option.
ru: Применяйте параметр ``--verbose``.

source: Do not use the ``--force`` option if you aren't sure that it's exactly what you need.
ru: Используйте параметр ``--force``, только если вы уверены, что это необходимо.

source: Please look at the :doc:`troubleshooting documentation </book/cartridge/troubleshooting>` before using ``repair``.
ru: Перед тем, как использовать команду ``repair``, ознакомьтесь с :doc:`руководством по разрешению проблем </book/cartridge/troubleshooting>`.

source: Subcommands
ru: Подкоманды

source: Below is a list of the available repair commands.
ru: Ниже приведен список доступных подкоманд.

source: Print the current topology summary. Requires no arguments.
ru: Вывод сводной информации о текущей топологии. Не требует аргументов.

source: Remove an instance with the specified UUID from the cluster. If the instance isn't found, raise an error.
ru: Удаление экземпляра с указанным UUID из кластера. Если экземпляр не найден, возвращается ошибка.

source: Set an instance as the leader of the replica set. Raise an error in the following cases:
ru: Назначение экземпляра лидером в наборе реплик. Команда вернет ошибку в следующих случаях:

source: There is no replica set or instance with that UUID.
ru: Набора реплик или экземпляра с указанным UUID не существует.

source: The instance doesn't belong to the replica set.
ru: Экземпляр не входит в набор реплик.

source: The instance has been disabled or expelled.
ru: Экземпляр отключен или исключен из кластера.

source: Rewrite the instance's :ref:`advertise_uri <cartridge-config-basic>` parameter. Raise an error if the instance isn't found or is expelled.
ru: Замена параметра :ref:`advertise_uri <cartridge-config-basic>`. Команда вернет ошибку, если экземпляр не обнаружен или исключен из кластера.

source: Flags
ru: Параметры

source: The following flags work with any ``repair`` subcommand:
ru: Следующие параметры можно использовать с любой подкомандой ``repair``:

source: (Required) Application name.
ru: Имя приложения (обязательно).

source: The directory containing the instances' working directories. Defaults to ``/var/lib/tarantool``.
ru: Директория, в которой находятся рабочие директории экземпляров, по умолчанию --- ``/var/lib/tarantool``.

source: The following flags work with any repair command except ``list-topology``:
ru: Следующие параметры можно использовать с любой подкомандой ``repair``, кроме ``list-topology``:

source: The directory where PID and socket files are stored. Defaults to ``/var/run/tarantool``.
ru: Директория, где хранятся PID-файлы и файлы сокетов. По умолчанию --- ``/var/run/tarantool``.

source: Launch in dry-run mode: show changes but do not apply them.
ru: Пробное выполнение команды: изменения отображаются, но не применяются.

source: Enable instance configuration reload after the patch.
ru: Загрузка конфигурации экземпляра после того, как будут внесены изменения.

source: The default data and run directories for ``repair`` differ from those used by other ``cartridge-cli`` commands. This is because ``repair`` is intended for production use, while other commands are for local development.
ru: В отличие от остальных команд ``cartridge-cli``, в ``repair`` по умолчанию используются другие директории запуска и хранения данных. Это связано с тем, что команда ``repair`` предназначена для выполнения в производственной среде, а остальные --- для локальной разработки.

source: ``repair`` also supports :doc:`global flags </book/cartridge/cartridge_cli/global-flags>`.
ru: Команда ``repair`` также поддерживает :doc:`глобальные параметры </book/cartridge/cartridge_cli/global-flags>`.

source: What does repair actually do?
ru: Как работает команда repair?

source: It patches cluster-wide instance configuration files that you have on your local machine. Note that it's not enough to *apply* the new configuration, the instance has to *reload* it.
ru: Команда обновляет хранящиеся на локальном компьютере файлы конфигурации экземпляров на уровне кластера. Обратите внимание, что просто *применить* новую конфигурацию недостаточно --- экземпляр должен *загрузить* ее.

source: Although ``repair`` was created for production use, it can still be applied in local development. The command requires to specify ``--name``, the application name. Also, remember that the default data directory is ``/var/lib/tarantool`` and the default run directory is ``/var/run/tarantool``. To specify other directories, use the ``data-dir`` and ``--run-dir`` options correspondingly or provide the paths in the :doc:`configuration file </book/cartridge/cartridge_cli/instance-paths>`.
ru: Изначально команда ``repair`` предназначалась для применения в производственной среде, однако ее можно использовать и для локальной разработки. Параметр ``--name`` (имя приложения) --- обязательный. Помните, что по умолчанию директория данных --- ``/var/lib/tarantool``, а директория запуска --- ``/var/run/tarantool``. Чтобы задать другие директории, используйте параметры ``data-dir`` и ``--run-dir`` соответственно. Вы можете также прописать эти параметры в :doc:`файле конфигурации </book/cartridge/cartridge_cli/instance-paths>`.

source: In default mode, ``repair`` walks through all cluster-wide configurations in the ``<data-dir>/<app-name>.*`` directories, patching all the configuration files it locates.
ru: По умолчанию ``repair`` применяет изменения ко всем конфигурациям на уровне кластера, найденным в директориях ``<data-dir>/<имя_приложения>.*``.

source: With the ``--dry-run`` flag specified, files won't be patched, and you will only see the computed configuration diff.
ru: Если указать параметр ``--dry-run``, на экране появятся различия в конфигурации, а сами файлы не изменятся.

source: If different instances on the local machine use different configuration files, ``repair`` raises an error. To patch different configuration versions independently, use the ``--force`` option.
ru: Если у разных экземпляров на локальном компьютере файлы конфигурации отличаются, ``repair`` вернет ошибку. Чтобы принудительно исправить разные версии конфигурации, используйте параметр ``--force``.

source: If your application uses ``cartridge >= 2.0.0``, you can also run ``repair`` with the ``--reload`` flag to reload configuration for all your instances through the console sockets in the run directory. Make sure that you have the correct run directory specified when you use ``--reload``.
ru: Если ваше приложение основано на версии ``cartridge >= 2.0.0``, вы можете загрузить обновленную конфигурацию для всех экземпляров через сокеты консоли из директории запуска, выполнив ``repair`` с параметром ``--reload``. Убедитесь, что при использовании ``--reload`` директория запуска указана правильно.
