Repository: tarantool/cartridge-cli
Catalog: doc/locale/*/LC_MESSAGES/doc/commands/replicasets.po
Languages: ru

source: Setting up replicasets
ru: Настройка наборов реплик

source: The ``cartridge replicasets`` command is used to configure replica sets on local start.
ru: Используйте команду ``cartridge replicasets``, чтобы настроить наборы реплик для локального запуска.

source: Usage
ru: Использование

source: cartridge replicasets [subcommand] [flags] [args]
ru: cartridge replicasets [подкоманда] [параметры] [аргументы]

source: The following flags work with any ``replicasets`` subcommand:
ru: В любой подкоманде ``replicasets`` можно использовать следующие параметры:

source: Application name.
ru: Имя приложения.

source: The directory where PID and socket files are stored. Defaults to ``./tmp/run`` or the ``run-dir`` value in ``.cartridge.yml``.
ru: Директория, где хранятся PID-файлы и файлы сокетов. По умолчанию --- ``./tmp/run`` или значение ``run-dir`` из файла ``.cartridge.yml``.

source: Instances' configuration file. Defaults to ``./instances.yml`` or the ``cfg`` value in ``.cartridge.yml``.
ru: Файл конфигурации экземпляра, по умолчанию --- ``./instances.yml`` или значение ``cfg`` из файла ``.cartridge.yml``.

source: How it works
ru: Принцип работы

source: Replicasets are configured using the Cartridge Lua API. All instances in the topology are described in a single file, ``instances.yml`` (see the ``--cfg`` flag). The instances receive their configuration through instance console sockets that can be found in the run directory.
ru: Наборы реплик в Cartridge настраиваются с помощью Lua API. Все экземпляры в топологии описываются в одном файле ``instances.yml`` (см. параметр ``--cfg``). Экземпляры получают конфигурацию через сокеты консоли, которые находятся в директории запуска.

source: First, all the running instances mentioned in ``instances.yml`` are organized into a :doc:`membership </reference/reference_rock/membership/>` network. In this way, Cartridge checks if there are any instances that have already joined the cluster. One of these instances is then used to perform cluster operations.
ru: Сначала все запущенные экземпляры, указанные в файле ``instances.yml``, объединяются в сеть :doc:`membership </reference/reference_rock/membership/>`. Таким образом Cartridge проверяет, входят ли уже какие-либо экземпляры в кластер. Один из таких экземпляров затем выполняет кластерные операции.

source: Subcommands
ru: Подкоманды

source: cartridge replicasets setup [flags]
ru: cartridge replicasets setup [параметры]

source: Setup replica sets using a file.
ru: Настройка наборов реплик с помощью файла.

source: Flags:
ru: Параметры:

source: File with replica set configuration. Defaults to ``replicasets.yml``.
ru: Файл с конфигурацией набора реплик. По умолчанию --- ``replicasets.yml``.

source: Bootstrap vshard upon setup.
ru: Инициализация vshard при первоначальной настройке.

source: Example configuration:
ru: Пример конфигурации:

source: All the instances should be described in ``instances.yml`` (or another file passed via ``--cfg``).
ru: Все экземпляры должны быть описаны в ``instances.yml`` (или другом файле, переданном в параметре ``--cfg``).

source: cartridge replicasets save [flags]
ru: cartridge replicasets save [параметры]

source: Saves the current replica set configuration to a file.
ru: Сохранение текущей конфигурации в файл.

source: The file to save the configuration to. Defaults to ``replicasets.yml``.
ru: Файл, в который сохраняется конфигурация. По умолчанию --- ``replicasets.yml``.

source: cartridge replicasets list [flags]
ru: cartridge replicasets list [параметры]

source: Lists the current cluster topology.
ru: Вывод текущей топологии кластера.

source: cartridge replicasets join [INSTANCE_NAME...] [flags]
ru: cartridge replicasets join [ИМЯ_ЭКЗЕМПЛЯРА...] [параметры]

source: Joins an instance to a cluster.
ru: Присоединение экземпляра к кластеру.

source: Name of the replica set
ru: Имя набора реплик.

source: If a replica set with the specified alias isn't found in cluster, it is created. Otherwise, instances are joined to an existing replica set.
ru: Если набор реплик с указанным алиасом уже есть в кластере, экземпляры присоединяются к этому набору. Если такого набора нет, он будет создан.

source: To join an instance to a replica set, Cartridge requires the instance to have its :ref:`advertise_uri <cartridge-config-basic>` specified in ``instances.yml``.
ru: Чтобы Cartridge присоединил экземпляр к набору реплик, в ``instances.yml`` должен быть указан параметр :ref:`advertise_uri <cartridge-config-basic>` этого экземпляра.

source: cartridge replicasets list-roles [flags]
ru: cartridge replicasets list-roles [параметры]

source: List the available roles.
ru: Вывод списка доступных ролей.

source: cartridge replicasets list-vshard-groups [flags]
ru: cartridge replicasets list-vshard-groups [параметры]

source: List the available vshard groups.
ru: Вывод списка доступных групп vshard.

source: cartridge replicasets add-roles [ROLE_NAME...] [flags]
ru: cartridge replicasets add-roles [ИМЯ_РОЛИ...] [параметры]

source: Add roles to the replica set.
ru: Добавление ролей в набор реплик.

source: Vshard group for ``vshard-storage`` replica sets
ru: Группа vshard для наборов реплик ``vshard-storage``.

source: cartridge replicasets remove-roles [ROLE_NAME...] [flags]
ru: cartridge replicasets remove-roles [ИМЯ_РОЛИ...] [параметры]

source: Remove roles from the replica set.
ru: Удаление ролей из набора реплик.

source: cartridge replicasets set-weight WEIGHT [flags]
ru: cartridge replicasets set-weight ВЕС [параметры]

source: Specify replica set weight.
ru: Определение веса набора реплик.

source: cartridge replicasets set-failover-priority INSTANCE_NAME... [flags]
ru: cartridge replicasets set-failover-priority ИМЯ_ЭКЗЕМПЛЯРА... [параметры]

source: Configure replica set failover priority.
ru: Изменение приоритета восстановления после сбоев.

source: cartridge replicasets bootstrap-vshard [flags]
ru: cartridge replicasets bootstrap-vshard [параметры]

source: Bootstrap vshard.
ru: Инициализация vshard.

source: cartridge replicasets expel [INSTANCE_NAME...] [flags]
ru: cartridge replicasets expel [ИМЯ_ЭКЗЕМПЛЯРА...] [параметры]

source: Expel one or more instances from the cluster.
ru: Исключение экземпляров из кластера.

source: Examples
ru: Примеры

source: We'll use an application created with ``cartridge create``. Here is its ``instances.yml`` file:
ru: В примере используется приложение, созданное командой ``cartridge create``. Файл ``instances.yml`` выглядит так:

source: --- myapp.router: advertise_uri: localhost:3301 http_port: 8081 myapp.s1-master: advertise_uri: localhost:3302 http_port: 8082 myapp.s1-replica: advertise_uri: localhost:3303 http_port: 8083 # other instances are hidden in this example
ru: --- myapp.router: advertise_uri: localhost:3301 http_port: 8081 myapp.s1-master: advertise_uri: localhost:3302 http_port: 8082 myapp.s1-replica: advertise_uri: localhost:3303 http_port: 8083 # остальные экземпляры в этом примере не показаны

source: Create two replicasets
ru: Создание двух наборов реплик

source: List the available roles
ru: Вывод списка доступных ролей

source: Set instance roles
ru: Назначение ролей для экземпляров

source: Bootstrap vshard
ru: Инициализация vshard

source: List current replica sets
ru: Вывод списка наборов реплик

source: Expel an instance
ru: Исключение экземпляра
