Repository: tarantool/cartridge-cli
Catalog: doc/locale/*/LC_MESSAGES/doc/commands/start.po
Languages: ru

source: Starting application instances locally
ru: Локальный запуск экземпляров приложения

source: You can start application instances for local development from the application directory:
ru: Для локальной разработки вы можете запускать экземпляры приложения из его корневой директории:

source: cartridge start [INSTANCE_NAME...] [flags]
ru: cartridge start [ИМЯ_ЭКЗЕМПЛЯРА...] [параметры]

source: where ``[INSTANCE_NAME...]`` means that more than one instance can be specified.
ru: Здесь ``[ИМЯ_ЭКЗЕМПЛЯРА...]`` означает, что можно указать больше одного имени.

source: If no ``INSTANCE_NAME`` is provided, all the instances from the Cartridge instance configuration file are taken as arguments. See the ``--cfg`` option below.
ru: Если не указать ``ИМЯ_ЭКЗЕМПЛЯРА``, в список аргументов войдут все экземпляры, перечисленные в файле конфигурации экземпляров Cartridge. См. параметр ``--cfg`` ниже.

source: During instance startup, the application name (``APP_NAME``) is passed to the instance. By default, this variable is taken from the ``package`` field of the application's ``.rockspec``. However, it can also be defined explicitly via the ``--name`` option (see description below).
ru: Имя приложения (``APP_NAME``) передается экземпляру во время запуска. По умолчанию значение переменной берется из поля ``package`` в файле ``.rockspec``. Также его можно указать с помощью параметра ``--name`` (см. ниже).

source: Flags
ru: Параметры

source: Application name. By default, it is taken from the ``package`` field of the application's ``.rockspec``.
ru: Имя приложения. По умолчанию значение берется из поля ``package`` в файле ``.rockspec``.

source: Time to wait for the instance(s) to start in the background. Can be specified in seconds or in the duration form (``72h3m0.5s``). Can't be negative. A ``0`` timeout means that Tarantool will wait forever for the instance(s) to start. The default timeout is 60 seconds (``1m0s``).
ru: Время, в течение которого ожидается запуск экземпляров в фоновом режиме, в секундах или в виде отрезка (``72h3m0.5s``). Значение не может быть отрицательным. Если задать ``0``, Tarantool будет бесконечно ожидать запуска экземпляров. По умолчанию --- 60 секунд (``1m0s``).

source: Start the instance(s) in the background. With this option, Tarantool also waits until the application's init script finishes evaluating. This is useful if ``init.lua`` requires time-consuming startup from a snapshot, and Tarantool has to wait for the startup to complete. Another use case would be if your application's init script generates errors, so Tarantool can handle them.
ru: Запуск экземпляра в фоновом режиме. Если задать этот параметр, Tarantool будет также ожидать, пока не выполнится скрипт инициализации приложения. Параметр удобно использовать, если ``init.lua`` требует долгой загрузки данных из снимка и Tarantool должен дождаться завершения запуска. Вы можете также передать этот параметр, если скрипт инициализации выдает ошибки, которые Tarantool должен обработать.

source: Start the application :ref:`stateboard <cartridge-stateful_failover>` and the instances. Ignored if ``--stateboard-only`` is specified.
ru: Запуск экземпляров, включая :ref:`stateboard <cartridge-stateful_failover>`-экземпляр. Игнорируется, если задать параметр ``--stateboard-only``.

source: Start only the application stateboard. If specified, ``INSTANCE_NAME...`` is ignored.
ru: Запуск stateboard-экземпляра. Если задать этот параметр, ``ИМЯ_ЭКЗЕМПЛЯРА...`` игнорируется.

source: Application entry point. The default value is ``init.lua`` in the project root directory. ``script`` is also a section in ``.cartridge.yml``. Learn more about :doc:`instance paths </book/cartridge/cartridge_cli/instance-paths>`.
ru: Точка входа в приложение, по умолчанию --- ``init.lua`` в корневой директории проекта. ``script`` --- также раздел файла ``.cartridge.yml``. Узнайте больше о :doc:`путях к файлам экземпляров </book/cartridge/cartridge_cli/instance-paths>`.

source: The directory where PID and socket files are stored. Defaults to ``./tmp/run``. ``run-dir`` is also a section of ``.cartridge.yml``. Learn more about :doc:`instance paths </book/cartridge/cartridge_cli/instance-paths>`.
ru: Директория, где хранятся PID-файлы и файлы сокетов (по умолчанию ``./tmp/run``). ``run-dir`` --- также раздел файла ``.cartridge.yml``. Узнайте больше о :doc:`путях к файлам экземпляров </book/cartridge/cartridge_cli/instance-paths>`.

source: The directory containing the working directories of instances. Defaults to ``./tmp/data``. ``data-dir`` is also a section of ``.cartridge.yml``. Learn more about :doc:`instance paths </book/cartridge/cartridge_cli/instance-paths>`.
ru: Директория, в которой находятся рабочие директории экземпляров (по умолчанию ``./tmp/data``). ``data-dir`` --- также раздел файла ``.cartridge.yml``. Узнайте больше о :doc:`путях к файлам экземпляров </book/cartridge/cartridge_cli/instance-paths>`.

source: The directory that stores logs for instances that are running in the background. Defaults to ``./tmp/log``. ``log-dir`` is also a section of ``.cartridge.yml``. Learn more about :doc:`instance paths </book/cartridge/cartridge_cli/instance-paths>`.
ru: Директория, где хранятся файлы журналов (по умолчанию ``./tmp/log``). ``log-dir`` --- также раздел файла ``.cartridge.yml``. Узнайте больше о :doc:`путях к файлам экземпляров </book/cartridge/cartridge_cli/instance-paths>`.

source: Path to the Cartridge instances configuration file. Defaults to ``./instances.yml``. ``cfg``is also a section of ``.cartridge.yml``. Learn more about :doc:`instance paths </book/cartridge/cartridge_cli/instance-paths>`.
ru: Путь к файлу конфигурации экземпляров (по умолчанию ``./instances.yml``). ``cfg`` --- также раздел файла ``.cartridge.yml``. Узнайте больше о :doc:`путях к файлам экземпляров </book/cartridge/cartridge_cli/instance-paths>`.

source: ``start`` also supports :doc:`global flags </book/cartridge/cartridge_cli/global-flags>`.
ru: Команда ``start`` также поддерживает :doc:`глобальные параметры </book/cartridge/cartridge_cli/global-flags>`.

source: Details
ru: Описание

source: The ``cartridge start`` command starts a Tarantool instance with enforced **environment variables**:
ru: Команда ``cartridge start`` запускает экземпляр Tarantool с принудительным использованием **переменных окружения**:

source: TARANTOOL_APP_NAME="<name>" TARANTOOL_INSTANCE_NAME="<instance-name>" TARANTOOL_CFG="<cfg>" TARANTOOL_PID_FILE="<run-dir>/<app-name>.<instance-name>.pid" TARANTOOL_CONSOLE_SOCK="<run-dir>/<app-name>.<instance-name>.control" TARANTOOL_WORKDIR="<data-dir>/<app-name>.<instance-name>.control"
ru: TARANTOOL_APP_NAME="<имя_приложения>" TARANTOOL_INSTANCE_NAME="<имя_экземпляра>" TARANTOOL_CFG="<cfg>" TARANTOOL_PID_FILE="<run-dir>/<имя_приложения>.<имя_экземпляра>.pid" TARANTOOL_CONSOLE_SOCK="<run-dir>/<имя_приложения>.<имя_экземпляра>.control" TARANTOOL_WORKDIR="<data-dir>/<имя_приложения>.<имя_экземпляра>.control"

source: If the instance is started in the background, a notify socket path is passed additionally:
ru: Если экземпляр запускается в фоновом режиме, в команде нужно также указать путь к notify-сокету:

source: NOTIFY_SOCKET="<data-dir>/<app-name>.<instance-name>.notify"
ru: NOTIFY_SOCKET="<data-dir>/<имя_приложения>.<имя_экземпляра>.notify"

source: ``cartridge.cfg()`` uses ``TARANTOOL_APP_NAME`` and ``TARANTOOL_INSTANCE_NAME`` to read the instance's configuration from the file provided in ``TARANTOOL_CFG``.
ru: ``cartridge.cfg()`` использует переменные ``TARANTOOL_APP_NAME`` и ``TARANTOOL_INSTANCE_NAME``, чтобы считывать конфигурацию экземпляра из файла, который указан в переменной ``TARANTOOL_CFG``.
