Repository: tarantool/cartridge-cli
Catalog: doc/locale/*/LC_MESSAGES/doc/commands/status.po
Languages: ru

source: Checking instance status
ru: Проверка статуса экземпляра

source: Run the ``status`` command to check the current status of one or more instances:
ru: Чтобы проверить текущий статус экземпляров, выполните команду ``status``:

source: where ``[INSTANCE_NAME...]`` means that more than one instance can be specified.
ru: Здесь ``[ИМЯ_ЭКЗЕМПЛЯРА...]`` означает, что можно указать больше одного имени.

source: If no ``INSTANCE_NAME`` is provided, all the instances from the Cartridge instance configuration file are taken as arguments. See the ``--cfg`` option below.
ru: Если не указать ``ИМЯ_ЭКЗЕМПЛЯРА``, в список аргументов войдут все экземпляры, перечисленные в файле конфигурации экземпляров Cartridge. См. параметр ``--cfg`` ниже.

source: Make sure the instance(s) you are checking were started with ``cartridge start -d``.
ru: Команда позволяет проверить только статус экземпляров, запущенных с помощью ``cartridge start -d``.

source: Flags
ru: Параметры

source: Application name. By default, it is taken from the ``package`` field of the application's ``.rockspec``.
ru: Имя приложения. По умолчанию значение берется из поля ``package`` в файле ``.rockspec``.

source: Get the status of the application stateboard and the instances. Ignored if ``--stateboard-only`` is specified.
ru: Получение статуса экземпляров, в том числе stateboard-экземпляра. Игнорируется, если задать параметр ``--stateboard-only``.

source: Get only the application stateboard status. If specified, ``INSTANCE_NAME...`` is ignored.
ru: Получение статуса stateboard-экземпляра. Если задать этот параметр, ``ИМЯ_ЭКЗЕМПЛЯРА...`` игнорируется.

source: The directory where PID and socket files are stored. Defaults to ``./tmp/run``. ``run-dir`` is also a section of ``.cartridge.yml``. Learn more about :doc:`instance paths </book/cartridge/cartridge_cli/instance-paths>`.
ru: Директория, где хранятся PID-файлы и файлы сокетов (по умолчанию ``./tmp/run``). ``run-dir`` --- также раздел файла ``.cartridge.yml``. Узнайте больше о :doc:`путях к файлам экземпляров </book/cartridge/cartridge_cli/instance-paths>`.

source: Path to the Cartridge instances configuration file. Defaults to ``./instances.yml``. ``cfg``is also a section of ``.cartridge.yml``. Learn more about :doc:`instance paths </book/cartridge/cartridge_cli/instance-paths>`.
ru: Путь к файлу конфигурации экземпляров (по умолчанию ``./instances.yml``). ``cfg`` --- также раздел файла ``.cartridge.yml``. Узнайте больше о :doc:`путях к файлам экземпляров </book/cartridge/cartridge_cli/instance-paths>`.

source: ``status`` also supports :doc:`global flags </book/cartridge/cartridge_cli/global-flags>`.
ru: Команда ``status`` также поддерживает :doc:`глобальные параметры </book/cartridge/cartridge_cli/global-flags>`.

source: Use the exact same ``run-dir`` as you did with ``cartridge start``. The PID files stored in that directory are used to stop running instances.
ru: Используйте ту же директорию запуска (``run-dir``), что и в команде ``cartridge start``. PID-файлы из этой директории используются для остановки запущенных экземпляров.
