Repository: tarantool/cartridge-cli
Catalog: doc/locale/*/LC_MESSAGES/doc/commands/pack/building-*-docker.po
Languages: in

source: Building in Docker
in: Сборка в Docker

source: To build your application in Docker, run this:
in: Чтобы собрать приложение в Docker, выполните следующую команду:

source: You might want to perform application build in Docker if your distributable is intended for a system different than the one you use.
in: Вам может понадобиться собрать приложение в Docker, если ваш дистрибутив предназначен для системы, отличной от той, что вы используете.

source: In this case, ``cartridge.pre-build``, ``tarantoolctl rocks make``, and ``cartridge.post-build`` run inside a Docker image that has a volume mapped onto the build directory. As a result, the build directory will contain Linux-specific application files and rock modules.
in: В этом случае ``cartridge.pre-build``, ``tarantoolctl rocks make`` и ``cartridge.post-build`` будут запущены в Docker-образе, том которого (Docker volume) привязан к директории сборки. В результате директория сборки будет содержать специфичные для Linux файлы приложения и модули ``rocks``.

source: If you want to package a distribution on your local machine without using Docker, check the :doc:`packaging overview </book/cartridge/cartridge_cli/commands/pack>`.
in: Если вы хотите собрать дистрибутив на вашей локальной машине без использования Docker, обратитесь к странице с описанием :doc:`команды pack </book/cartridge/cartridge_cli/commands/pack>`.

source: Flags
in: Параметры

source: Path to the base Dockerfile of the build image. Defaults to ``Dockerfile.build.cartridge`` in the application root directory.
in: Путь к базовому файлу Dockerfile сборочного образа. По умолчанию это ``Dockerfile.build.cartridge`` в корневой директории приложения.

source: Images that work as cache sources for both build and runtime images. See the ``--cache-from`` flag for ``docker build``.
in: Образы, которые служат источниками кэша и для сборочного, и для запускаемого образа. Ознакомьтесь с работой параметра ``--cache-from`` команды ``docker build``.

source: Enterprise only. Path to the SDK to be delivered in the final artifact. Alternatively, you can pass the path via the ``TARANTOOL_SDK_PATH`` environment variable, which is of lower priority.
in: Только для Tarantool Enterprise. Путь к SDK, включаемому в итоговый артефакт. Этот путь можно также передать с помощью переменной среды ``TARANTOOL_SDK_PATH``, однако у нее ниже приоритет.

source: Enterprise only. Deliver the SDK from the local machine in the final artifact.
in: Только для Tarantool Enterprise. Используется, чтобы включить SDK с локальной машины в итоговый артефакт.

source: If you're building a Tarantool Enterprise application in Docker, make sure you specify the path to the SDK you want to include in the image. Do that using the ``--sdk-path`` flag or the environment variable ``TARANTOOL_SDK_PATH``, which has lower priority. To specify the currently activated SDK, pass the ``--sdk-local`` flag.
in: Собирая приложение на Tarantool Enterprise в Docker, убедитесь, что вы указали путь к SDK для включения в образ. Можно задать путь с помощью параметра ``--sdk-path`` или использовать переменную среды ``TARANTOOL_SDK_PATH``, имеющую более низкий приоритет. Чтобы выбрать текущий SDK, передайте параметр ``--sdk-local``.

source: Build image
in: Сборочный образ

source: The image where the package is built will be referred to as the build image. It has the following structure:
in: Сборочным образом мы будем называть образ, который используется для сборки пакета. Он имеет следующую структуру:

source: Base image: ``centos:7`` (see below).
in: Базовый образ: ``centos:7`` (подробности далее).

source: Pre-installed packages: ``git``, ``gcc``, ``make``, ``cmake``, ``unzip``. These are the packages required for building the default ``cartridge`` application.
in: Предустановленные пакеты: ``git``, ``gcc``, ``make``, ``cmake`` и ``unzip``. Эти пакеты необходимы для сборки приложения ``cartridge``.

source: The image includes a version of Tarantool:
in: Образ будет включать одну из версий Tarantool:

source: If you use open-source Tarantool, the image contains the same version you've used for local development.
in: Если вы используете для локальной разработки версию Tarantool с открытым исходным кодом, образ будет содержать ту же версию.

source: If you use Tarantool Enterprise, the SDK with Tarantool Enterprise binaries is copied to the image. See the ``--sdk-path`` and ``--sdk-local`` flags.
in: Если вы используете Tarantool Enterprise, в образ будет скопирован SDK, содержащий бинарные файлы Tarantool Enterprise. Обратитесь к описанию параметров ``--sdk-path`` и ``--sdk-local`` выше.

source: To customize your build image, use the ``Dockerfile.build.cartridge`` file in the application root directory.
in: Изменить настройки сборочного образа можно в файле ``Dockerfile.build.cartridge`` в корневой директории приложения.

source: Installing packages required for application build
in: Установка пакетов, требуемых для сборки приложения

source: By default, the build image is based on ``centos:7``. ``git``, ``gcc``, ``make``, ``cmake``, and ``unzip`` packages are installed in that image. If your application requires other packages for building, you can specify more base layers for the build image.
in: По умолчанию сборочный образ основан на ``centos:7`` и включает предустановленные пакеты ``git``, ``gcc``, ``make``, ``cmake`` и ``unzip``. Если для сборки приложения требуются другие пакеты, вы можете задать для сборочного образа дополнительные базовые слои (Docker layers).

source: To do that, place the file ``Dockerfile.build.cartridge`` in your application root directory or pass a path to another Dockerfile with the ``--build-from`` flag. Make sure your Dockerfile starts with the line ``FROM centos:7`` (except comments).
in: Разместите файл ``Dockerfile.build.cartridge`` в корневой директории вашего приложения или передайте путь к другому Dockerfile с помощью параметра ``--build-from``. Убедитесь, что ваш Dockerfile начинается со строки ``FROM centos:7`` (не считая комментариев).

source: For example, if your application build requires ``gcc-c++``, customize the Dockerfile as follows:
in: Например, если для сборки приложения требуется ``gcc-c++``, в Dockerfile должны быть следующие строки:

source: ``git``, ``gcc``, ``make``, ``cmake``, and ``unzip`` will be installed anyway on the next layer.
in: Пакеты ``git``, ``gcc``, ``make``, ``cmake`` и ``unzip`` будут в любом случае установлены на следующем слое.
