Repository: tarantool/cartridge-cli
Catalog: doc/locale/*/LC_MESSAGES/doc/commands/pack/docker.po
Languages: ru

source: Packaging an application into a Docker image
ru: Упаковка приложения в Docker-образ

source: ``cartridge pack docker`` builds a Docker image that can be used to start containers of application instances.
ru: Команда ``cartridge pack docker`` создает Docker-образ, позволяющий запускать экземпляры приложения в контейнерах.

source: Flags
ru: Параметры

source: Use these flags to control the local packaging of a Docker image. For flags applicable for packaging any distribution type, check the :doc:`packaging overview </book/cartridge/cartridge_cli/commands/pack>`.
ru: Используйте следующие параметры для управления локальной упаковкой Docker-образов. На странице с описанием :doc:`команды pack </book/cartridge/cartridge_cli/commands/pack>` вы найдете параметры, применимые к любому типу дистрибутива.

source: Tag(s) of the Docker image that results from ``cartridge pack docker``.
ru: Тег или теги Docker-образа, собранного с помощью ``cartridge pack docker``.

source: Path to the base Dockerfile of the result image. Defaults to ``Dockerfile.cartridge`` in the application root directory.
ru: Путь к базовому файлу Dockerfile итогового образа. По умолчанию это ``Dockerfile.cartridge`` в корневой директории приложения.

source: Result image tag
ru: Тег итогового образа

source: The result image is tagged as follows:
ru: Возможные варианты тегов для итогового образа:

source: ``<name>:<detected-version>[-<suffix>]``: by default.
ru: ``<имя>:<выявленная-версия>[-<суффикс>]`` --- по умолчанию;

source: ``<name>:<version>[-<suffix>]``: if the ``--version`` parameter is specified.
ru: ``<имя>:<версия>[-<суффикс>]`` --- если был задан параметр ``--version``;

source: ``<tag>``: if the ``--tag`` parameter is specified.
ru: ``<тег>`` --- если был задан параметр ``--tag``.

source: Starting application instances
ru: Запуск экземпляров приложения

source: To start ``instance-1`` of the ``myapp`` application, run:
ru: Чтобы запустить экземпляр ``instance-1`` приложения ``myapp``, выполните:

source: By default, ``TARANTOOL_INSTANCE_NAME`` is set to ``default``.
ru: Значение переменной ``TARANTOOL_INSTANCE_NAME`` по умолчанию --- ``default``.

source: You can specify the environment variables ``CARTRIDGE_RUN_DIR`` and ``CARTRIDGE_DATA_DIR``:
ru: Вы можете задать переменные среды ``CARTRIDGE_RUN_DIR`` и ``CARTRIDGE_DATA_DIR`` следующим образом:

source: ``CARTRIDGE_DATA_DIR`` is the working directory that contains the instance's PID file and console socket. By default, it is set to ``/var/lib/tarantool``.
ru: ``CARTRIDGE_DATA_DIR`` --- рабочая директория, в которой хранятся сокет консоли (console socket) и PID-файл экземпляра. По умолчанию это директория ``/var/lib/tarantool``.

source: You can also set variables like ``TARANTOOL_WORKDIR``, ``TARANTOOL_PID_FILE``, and ``TARANTOOL_CONSOLE_SOCK``:
ru: Вы также можете задать ``TARANTOOL_WORKDIR``, ``TARANTOOL_PID_FILE``, ``TARANTOOL_CONSOLE_SOCK`` и другие переменные:

source: To check the instance logs, run:
ru: Чтобы просмотреть журнал экземпляра, выполните команду:

source: Image details
ru: Сведения об образе

source: The base image is ``centos:7`` (see below).
ru: Образ собирается на основе ``centos:7`` (подробности далее).

source: The application code is placed in ``/usr/share/tarantool/<app-name>``. An open-source version of Tarantool is installed to the image.
ru: Код приложения расположен в ``/usr/share/tarantool/<имя_приложения>``. Образ уже включает установленную версию Tarantool с открытым исходным кодом.

source: The run directory is ``/var/run/tarantool/<app-name>``. The workdir is ``/var/lib/tarantool/<app-name>``.
ru: Директория запуска --- ``/var/run/tarantool/<имя_приложения>``, рабочая директория --- ``/var/lib/tarantool/<имя_приложения>``.

source: The runtime image also contains the file ``/usr/lib/tmpfiles.d/<app-name>.conf`` that allows the instance to restart after container reboot.
ru: В запускаемом образе также содержится файл ``/usr/lib/tmpfiles.d/<имя_приложения>.conf``, благодаря которому экземпляр перезапускается после перезагрузки контейнера.

source: It is the user's responsibility to set up the proper ``advertise_uri`` parameter (``<host>:<port>``) if the containers are deployed on different machines. Make sure each instance's ``advertise_uri`` is the same on all machines, because all other instances will use it to connect to that instance. Suppose you start an instance with ``advertise_uri`` set to ``localhost:3302``. Addressing that instance as ``<instance-host>:3302`` from a different instance won't work, because other instances will only recognize it as ``localhost:3302``.
ru: Ответственность за установку правильного параметра ``advertise_uri`` (``<host>:<port>``) в ситуации, когда контейнеры развернуты на разных машинах, лежит на пользователе. Убедитесь, что параметр ``advertise_uri`` каждого экземпляра идентичен на всех машинах. Это необходимо, чтобы экземпляры могли друг к другу подключаться. Предположим, вы запустили экземпляр, у которого в качестве ``advertise_uri`` указано значение ``localhost:3302``. Другие экземпляры не смогут обращаться к нему по URI ``<instance-host>:3302``, потому что распознают его только как ``localhost:3302``.

source: If you specify only the port, ``cartridge`` will use an auto-detected IP. In this case you have to configure Docker networks to set up inter-instance communication.
ru: Если указать только порт, ``cartridge`` будет использовать IP, определяемый автоматически. В этом случае необходимо настроить сети Docker, чтобы экземпляры могли подключаться друг к другу.

source: You can use Docker volumes to store instance snapshots and xlogs on the host machine. If you updated your application code, you can create a new image for it, stop the old container, and start a new one using the new image.
ru: Вы можете использовать тома Docker (Docker volumes), чтобы хранить на машине-хосте снимки данных экземпляра и его журналы ``.xlog``. Если вы внесли изменения в код приложения, вы можете создать для него новый Docker-образ, остановить старый контейнер, а затем запустить новый на основе нового образа.

source: Installing packages required by the application in runtime
ru: Установка пакетов, требуемых для работы приложения

source: By default, the result image is based on ``centos:7``.
ru: По умолчанию образ основан на ``centos:7``.

source: If your application requires some other packages in runtime, you can specify base layers for result image.
ru: Если приложению требуются для работы какие-либо пакеты, можно задать для итогового образа дополнительные базовые слои (Docker layers).

source: Place the file ``Dockerfile.cartridge`` in your application root directory or pass a path to another Dockerfile with the ``--from`` flag. Make sure your Dockerfile starts with the line ``FROM centos:7`` or ``FROM centos:8`` (except comments).
ru: Разместите файл ``Dockerfile.cartridge`` в корневой директории приложения или передайте путь к другому Dockerfile с помощью параметра ``--from``. Убедитесь, что Dockerfile начинается со строки ``FROM centos:7`` или ``FROM centos:8`` (не считая комментариев).

source: For example, if your application requires ``zip`` for runtime, customize the Dockerfile as follows:
ru: Например, если вашему приложению для выполнения требуется ``zip``, в Dockerfile должны быть следующие строки:
