Repository: tarantool/cartridge-cli
Catalog: doc/locale/*/LC_MESSAGES/doc/commands/pack/rpm-deb.po
Languages: ru

source: Packaging an application into RPM or DEB
ru: Упаковка приложения в RPM- или DEB-дистрибутив

source: ``cartridge pack rpm|deb`` creates an RPM or DEB package.
ru: Команда ``cartridge pack rpm|deb`` создает RPM- или DEB-пакет.

source: Flags
ru: Параметры

source: Use the following flags to control the local packaging of an RPM or DEB distribution. For flags that are applicable for packaging any distribution type, check the :doc:`packaging overview </book/cartridge/cartridge_cli/commands/pack>`.
ru: Локальной упаковкой дистрибутива RPM или DEB можно управлять с помощью параметров ниже. Параметры, общие для всех типов дистрибутивов, вы найдете на странице с описанием :doc:`команды pack </book/cartridge/cartridge_cli/commands/pack>`.

source: Defines the dependencies of the package.
ru: Зависимости пакета.

source: Path to the file that contains package dependencies. Defaults to ``package-deps.txt`` in the application directory.
ru: Путь к файлу, содержащему зависимости пакета. По умолчанию это ``package-deps.txt`` в директории приложения.

source: Path to the pre-install script for RPM and DEB packages.
ru: Путь к скрипту, выполняемому перед установкой RPM-/DEB-пакета.

source: Path to the post-install script for RPM and DEB packages.
ru: Путь к скрипту, выполняемому после установки RPM-/DEB-пакета.

source: Path to the template for the ``systemd`` unit file.
ru: Путь к шаблону юнит-файла для ``systemd``.

source: Path to the template for the ``systemd`` instantiated unit file.
ru: Путь к шаблону юнит-файла для ``systemd``, позволяющего запускать экземпляры приложения (instantiated unit file).

source: Path to the template for the stateboard ``systemd`` unit file.
ru: Путь к шаблону юнит-файла для ``systemd``, позволяющего запустить stateboard-экземпляр приложения.

source: Path to the file that contains unit parameters for ``systemd`` unit files. Defaults to ``systemd-unit-params.yml`` in the application root directory.
ru: Путь к файлу, содержащему параметры юнит-файла для ``systemd``. По умолчанию --- ``systemd-unit-params.yml`` в директории приложения.

source: Package contents
ru: Содержимое пакета

source: The resulting artifact name is ``<app-name>-<version>[-<suffix>].{rpm,deb}``.
ru: Итоговый артефакт получит следующее название: ``<имя_приложения>-<версия>[-<суффикс>].{rpm,deb}``.

source: The package name is ``<app-name>`` no matter what the artifact name is.
ru: Имя пакета аналогично имени приложения и не зависит от имени артефакта.

source: If you're using an open-source version of Tarantool, the package has a ``tarantool`` dependency (version >= ``<major>.<minor>`` and < ``<major+1>``, where ``<major>.<minor>`` is the version of Tarantool used for packaging the application).
ru: Если вы используете для разработки версию Tarantool с открытым исходным кодом, пакет будет содержать зависимость ``tarantool`` с версией >= ``<major>.<minor>`` и < ``<major+1>``, где ``<major>.<minor>`` --- версия Tarantool, которую вы использовали для упаковки приложения.

source: The package contents are as follows:
ru: В пакет будут помещены следующие файлы:

source: Contents of the application directory. They will be placed at ``/usr/share/tarantool/<app-name>``. In case of Tarantool Enterprise, this directory also contains the ``tarantool`` and ``tarantoolctl`` binaries.
ru: Содержимое директории приложения. Будет распаковано в ``/usr/share/tarantool/<имя_приложения>``. Если вы используете Tarantool Enterprise, директория также будет содержать бинарные файлы ``tarantool`` и ``tarantoolctl``.

source: Unit files that allow running the application as a ``systemd`` service. They will be unpacked as ``/etc/systemd/system/<app-name>.service`` and ``/etc/systemd/system/<app-name>@.service``.
ru: Юнит-файлы, позволяющие запускать приложение как сервис ``systemd``. Будут распакованы как ``/etc/systemd/system/<имя_приложения>.service`` и ``/etc/systemd/system/<имя_приложения>@.service``.

source: Application stateboard unit file. When unpacked, it is placed at ``/etc/systemd/system/<app-name>-stateboard.service``. This file will be packed only if the application contains ``stateboard.init.lua`` in its root directory.
ru: Юнит-файл stateboard-экземпляра приложения. При распаковке помещается в ``/etc/systemd/system/<имя_приложения>-stateboard.service``. Будет упакован, только если в корневом каталоге приложения есть файл ``stateboard.init.lua``.

source: The file ``/usr/lib/tmpfiles.d/<app-name>.conf``, which allows the instance to restart after server reboot.
ru: Файл ``/usr/lib/tmpfiles.d/<имя_приложения>.conf``, благодаря которому экземпляр перезапускается после перезагрузки сервера.

source: Upon package installation, the following directories are created:
ru: При установке пакета создаются следующие директории:

source: ``/etc/tarantool/conf.d/`` stores instance configuration.
ru: ``/etc/tarantool/conf.d/``, где хранится конфигурация экземпляров;

source: ``/var/lib/tarantool/`` stores instance snapshots.
ru: ``/var/lib/tarantool/``, где хранятся снимки данных экземпляров;

source: ``/var/run/tarantool/`` stores PID files and console sockets.
ru: ``/var/run/tarantool/``, где хранятся PID-файлы и сокеты консоли (console sockets).

source: Dependencies
ru: Зависимости

source: The ``--deps`` and ``--deps-file`` flags require similar formats of dependency information. However, ``--deps`` does not allow you to specify major and minor versions:
ru: Параметры ``--deps`` и ``--deps-file`` требуют схожих форматов информации о зависимостях. Однако параметр ``--deps`` не позволяет указывать мажорные и минорные версии:

source: # You can't do that: cartridge pack rpm --deps dependency_06>=4,<5 appname # Instead, do this: cartridge pack rpm --deps dependency_06>=4,dependency_06<5 appname # Or this: cartridge pack rpm --deps dependency_06>=4 --deps dependency_06<5 appname
ru: # Так сделать не удастся: cartridge pack rpm --deps dependency_06>=4,<5 appname # Вместо этого укажите версии так: cartridge pack rpm --deps dependency_06>=4,dependency_06<5 appname # Или так: cartridge pack rpm --deps dependency_06>=4 --deps dependency_06<5 appname

source: ``--deps-file`` lets you specify dependencies in a file (``package-deps.txt`` by default). The file is located in the application root directory. If you created your application from template, ``package-deps.txt`` is already there.
ru: С помощью параметра ``--deps-file`` можно указать файл, где перечислены зависимости. По умолчанию это файл ``package-deps.txt``, расположенный в корневой директории приложения. Если вы создали приложение по шаблону, файл ``package-deps.txt`` уже находится в корневой директории.

source: Example dependencies file
ru: Пример файла зависимостей

source: Each line must describe a single dependency. You can specify both the major and minor versions of the dependency:
ru: Каждая строка должна описывать одну зависимость. Для каждой зависимости можно указать как мажорную, так и минорную версию:

source: Pre-install and post-install scripts
ru: Скрипты, выполняемые перед установкой и после нее

source: You can add Bash scripts that will run before and after the installation of your RPM/DEB package. This might be useful, for example, if you want to set up symlinks. Place these files in your application root directory:
ru: Вы можете добавить Bash-скрипты, которые будут запущены до установки вашего RPM/DEB-пакета и после неё соответственно. Это может пригодиться, например, если вы хотите настроить символические ссылки (symlinks). Поместите эти файлы в корневую директорию приложения.

source: ``preinst.sh`` is the default name of the pre-install script. ``postinst.sh`` is the default name of the post-install script.
ru: Скрипт, выполняемый перед установкой, по умолчанию носит имя ``preinst.sh``, а скрипт, выполняемый после установки --- ``postinst.sh``.

source: To specify other names, use ``cartridge pack`` with the ``--preinst`` and ``--postinst`` flags correspondingly.
ru: Чтобы указать другие имена скриптов, используйте соответствующие параметры ``--preinst`` и ``--postinst`` в ``cartridge pack``.

source: Provide absolute paths to executables in the pre- and post-install scripts, or use ``/bin/sh -c ''`` instead.
ru: Укажите абсолютные пути к исполняемым файлам скриптов или используйте ``/bin/sh -c ''``.

source: Example pre-/post-install script
ru: Пример скрипта

source: /bin/sh -c 'touch file-path' /bin/sh -c 'mkdir dir-path' # or /bin/mkdir dir-path
ru: /bin/sh -c 'touch file-path' /bin/sh -c 'mkdir dir-path' # или /bin/mkdir dir-path

source: Customizing systemd unit files
ru: Конфигурация юнит-файлов systemd

source: Use the flags ``--unit-template``, ``--instantiated-unit-template``, and ``--stateboard-unit-template`` to customize standard unit files.
ru: Используйте параметры ``--unit-template``, ``--instantiated-unit-template`` и ``--stateboard-unit-template``, чтобы сделать юнит-файлы приложения отличными от стандартных.

source: One reason to customize standard unit files is if you want to deploy your RPM/DEB package on a platform different from the one where you've built it. In this case, ``ExecStartPre`` may contain an incorrect path to `mkdir`. As a hotfix, we suggest editing the unit files.
ru: Одной из причин для модификации стандартных юнит-файлов может быть необходимость развертывания вашего RPM/DEB-пакета на платформе, отличной от той, на которой вы его собирали. В этом случае ``ExecStartPre`` может содержать неверный путь к `mkdir`. В качестве легкого решения мы предлагаем редактирование юнит-файлов.

source: The unit files can contain `text templates <https://golang.org/pkg/text/template/>`__.
ru: Юнит-файлы могут содержать `текстовые шаблоны <https://golang.org/pkg/text/template/>`__.

source: Example
ru: Пример

source: This is an instantiated unit file.
ru: Это юнит-файл, позволяющий запускать экземпляры приложения.

source: [Unit] Description=Tarantool Cartridge app {{ .Name }}@%i After=network.target [Service] Type=simple ExecStartPre=/bin/sh -c 'mkdir -p {{ .InstanceWorkDir }}' ExecStart={{ .Tarantool }} {{ .AppEntrypointPath }} Restart=on-failure RestartSec=2 User=tarantool Group=tarantool Environment=TARANTOOL_APP_NAME={{ .Name }} Environment=TARANTOOL_WORKDIR={{ .InstanceWorkDir }} Environment=TARANTOOL_CFG={{ .ConfPath }} Environment=TARANTOOL_PID_FILE={{ .InstancePidFile }} Environment=TARANTOOL_CONSOLE_SOCK={{ .InstanceConsoleSock }} Environment=TARANTOOL_INSTANCE_NAME=%i LimitCORE=infinity # Disable OOM killer OOMScoreAdjust=-1000 # Increase fd limit for Vinyl LimitNOFILE=65535 # Systemd waits until all xlogs are recovered TimeoutStartSec=86400s # Give a reasonable amount of time to close xlogs TimeoutStopSec=10s [Install] WantedBy=multi-user.target Alias={{ .Name }}.%i
ru: [Unit] Description=Tarantool Cartridge app {{ .Name }}@%i After=network.target [Service] Type=simple ExecStartPre=/bin/sh -c 'mkdir -p {{ .InstanceWorkDir }}' ExecStart={{ .Tarantool }} {{ .AppEntrypointPath }} Restart=on-failure RestartSec=2 User=tarantool Group=tarantool Environment=TARANTOOL_APP_NAME={{ .Name }} Environment=TARANTOOL_WORKDIR={{ .InstanceWorkDir }} Environment=TARANTOOL_CFG={{ .ConfPath }} Environment=TARANTOOL_PID_FILE={{ .InstancePidFile }} Environment=TARANTOOL_CONSOLE_SOCK={{ .InstanceConsoleSock }} Environment=TARANTOOL_INSTANCE_NAME=%i LimitCORE=infinity # Отключение OOM killer OOMScoreAdjust=-1000 # Увеличение лимита fd для Vinyl LimitNOFILE=65535 # Systemd ожидает, пока все логи xlog не будут восстановлены TimeoutStartSec=86400s # Ожидание, пока не закроются логи xlog TimeoutStopSec=10s [Install] WantedBy=multi-user.target Alias={{ .Name }}.%i

source: Supported variables
ru: Поддерживаемые переменные

source: Application name.
ru: Имя приложения.

source: Application stateboard name (``<app-name>-stateboard``).
ru: Имя stateboard-экземпляра приложения (``<имя_приложения>-stateboard``).

source: Default instance working directory (``/var/lib/tarantool/<app-name>.default``).
ru: Рабочая директория экземпляра, заданная по умолчанию (``/var/lib/tarantool/<имя_приложения>.default``).

source: Application instance working directory (``/var/lib/tarantool/<app-name>.<instance-name>``).
ru: Рабочая директория приложения, заданная по умолчанию (``/var/lib/tarantool/<имя_приложения>.<instance-name>``).

source: Stateboard working directory (``/var/lib/tarantool/<app-name>-stateboard``).
ru: Рабочая директория stateboard-экземпляра (``/var/lib/tarantool/<имя_приложения>-stateboard``).

source: Default instance PID file (``/var/run/tarantool/<app-name>.default.pid``).
ru: PID-файл экземпляра, заданный по умолчанию (``/var/run/tarantool/<имя_приложения>.default.pid``).

source: Application instance PID file (``/var/run/tarantool/<app-name>.<instance-name>.pid``).
ru: PID-файл экземпляра приложения (``/var/run/tarantool/<имя_приложения>.<имя_экземпляра>.pid``).

source: Stateboard PID file (``/var/run/tarantool/<app-name>-stateboard.pid``).
ru: PID-файл stateboard-экземпляра (``/var/run/tarantool/<имя_приложения>-stateboard.pid``).

source: Default instance console socket (``/var/run/tarantool/<app-name>.default.control``).
ru: Сокет консоли экземпляра, заданный по умолчанию (``/var/run/tarantool/<имя_приложения>.default.control``).

source: Application instance console socket (``/var/run/tarantool/<app-name>.<instance-name>.control``).
ru: Сокет консоли экземпляра приложения (``/var/run/tarantool/<имя_приложения>.<имя_экземпляра>.control``).

source: Stateboard console socket (``/var/run/tarantool/<app-name>-stateboard.control``).
ru: Сокет консоли stateboard-экземпляра (``/var/run/tarantool/<имя_приложения>-stateboard.control``).

source: Path to the application instances config (``/etc/tarantool/conf.d``).
ru: Путь к конфигурации экземпляров приложения (``/etc/tarantool/conf.d``).

source: Path to the application entrypoint (``/usr/share/tarantool/<app-name>/init.lua``).
ru: Путь к точке входа приложения (``/usr/share/tarantool/<имя_приложения>/init.lua``).

source: Path to the stateboard entrypoint (``/usr/share/tarantool/<app-name>/stateboard.init.lua``).
ru: Путь к точке входа stateboard-экземпляра (``/usr/share/tarantool/<имя_приложения>/stateboard.init.lua``).

source: Passing parameters to unit files
ru: Передача параметров юнит-файлам

source: You can pass certain parameters to your application's unit files using a special file. By default, it is ``systemd-unit-params.yml``, located in the project directory. To use a different file, specify its name with the ``--unit-params-file`` flag.
ru: Вы можете передать некоторые параметры в юнит-файл приложения, используя специальный файл настроек --- по умолчанию это ``systemd-unit-params.yml`` в директории проекта. Чтобы использовать другой файл, укажите его имя с помощью параметра ``--unit-params-file`` команды ``cartridge pack rpm|deb``.

source: For example, the ``fd-limit`` option lets you limit the number of file descriptors determined by the ``LimitNOFILE`` parameter in the ``systemd`` unit file and instantiated unit file. Another example would be ``stateboard-fd-limit``, which lets you set the file descriptor limit in the stateboard ``systemd`` unit file.
ru: Например, ``fd-limit`` позволяет ограничить количество файловых дескрипторов, определяемое параметром ``LimitNOFILE`` юнит-файла. Еще один пример параметра, который можно указать в файле ``systemd-unit-params.yml`` --- это ``stateboard-fd-limit``. С его помощью можно установить лимит файловых дескрипторов в юнит-файле для ``systemd``, позволяющем запускать stateboard.

source: You can also pass parameters by env with the systemd unit file. To do so, specify the instance and stateboard arguments in the unit parameters file. The parameter will convert to ``Environment=TARANTOOL_<PARAM>: <value>`` in the unit file. Note that these variables have higher priority than the variables in the instance configuration file (``--cfg``).
ru: Вы также можете передать параметры юнит-файлу для ``systemd`` с помощью переменных окружения. Для этого укажите аргументы для экземпляра приложения и stateboard-экземпляра в конфигурации юнит-файла. Переданный параметр будет преобразован в строку ``Environment=TARANTOOL_<параметр>: <значение>`` в юнит-файле. Обратите внимание, что у этих переменных приоритет будет выше, чем у переменных, заданных в файле конфигурации экземпляра (``--cfg``).

source: Supported parameters
ru: Поддерживаемые параметры

source: ``LimitNOFILE`` for an application instance
ru: ``LimitNOFILE`` для экземпляра приложения

source: ``LimitNOFILE`` for a stateboard instance
ru: ``LimitNOFILE`` для экземпляра stateboard

source: :doc:`cartridge.argparse </book/cartridge/cartridge_api/modules/cartridge.argparse>` environment variables (like ``net-msg-max``) for an application instance
ru: Переменные окружения :doc:`cartridge.argparse </book/cartridge/cartridge_api/modules/cartridge.argparse>` (например, ``net-msg-max``) для экземпляра приложения

source: :doc:`cartridge.argparse </book/cartridge/cartridge_api/modules/cartridge.argparse>` environment variables (like ``net-msg-max``) for a stateboard instance
ru: Переменные окружения :doc:`cartridge.argparse </book/cartridge/cartridge_api/modules/cartridge.argparse>` (например, ``net-msg-max``) для stateboard-экземпляра приложения

source: fd-limit: 1024 stateboard-fd-limit: 2048 instance-env: app-name: 'my-app' net_msg_max: 1024 pid_file: '/some/special/dir/my-app.%i.pid' my-param: 'something' # or # TARANTOOL_MY_PARAM: 'something' stateboard-env: app-name: 'my-app-stateboard' pid_file: '/some/special/dir/my-app-stateboard.pid'
ru: fd-limit: 1024 stateboard-fd-limit: 2048 instance-env: app-name: 'my-app' net_msg_max: 1024 pid_file: '/some/special/dir/my-app.%i.pid' my-param: 'something' # или # TARANTOOL_MY_PARAM: 'something' stateboard-env: app-name: 'my-app-stateboard' pid_file: '/some/special/dir/my-app-stateboard.pid'

source: Some ``systemd`` unit parameters can be listed in the ``systemd-unit-params.yml`` file in the project directory. You can also use a file with a different name, specifying it in the ``--unit-params-file`` option.
ru: Некоторые параметры юнит-файла для ``systemd`` могут быть указаны в файле ``systemd-unit-params.yml`` в директории проекта. Чтобы использовать другой файл, укажите его имя с помощью параметра ``--unit-params-file``.

source: Installation
ru: Установка

source: If you are using open-source Tarantool, your application package has Tarantool as a dependency. In this case, before installing your RPM/DEB package, you have to enable the Tarantool repo to allow your package manager to install this dependency correctly:
ru: Если вы используете для разработки версию Tarantool с открытым исходным кодом, Tarantool будет среди зависимостей пакета. В этом случае перед установкой собранного RPM-/DEB-пакета необходимо подключить репозиторий Tarantool и разрешить менеджеру пакетов установить эту зависимость:

source: After this, you can install the application package.
ru: После этого можно устанавливать пакет приложения.

source: Starting application instances
ru: Запуск экземпляров приложения

source: After you've installed the package, configure the instances you want to start.
ru: После установки пакета настройте экземпляры, которые хотите запустить.

source: For example, if your application name is ``myapp`` and you want to start two instances, you might put the following ``myapp.yml`` file in the ``/etc/tarantool/conf.d`` directory:
ru: Вот как может выглядеть файл настроек ``myapp.yml``, расположенный в директории ``/etc/tarantool/conf.d`` и позволяющий запустить два экземпляра приложения ``myapp``:

source: Learn more about :ref:`configuring Cartridge application instances <cartridge-config-basic>`.
ru: Узнайте больше о :ref:`настройке экземпляров приложений на Cartridge <cartridge-config-basic>`.

source: Now start the instances you've configured:
ru: Теперь запустите настроенные экземпляры:

source: If you use stateful failover, start the application stateboard as well. Make sure that your application has ``stateboard.init.lua`` in its root directory.
ru: Если восстановление после cбоев у вас работает в режиме ``stateful``, запустите также stateboard-экземпляр приложения. Убедитесь, что в корневой директории приложения есть файл ``stateboard.init.lua``.

source: Add the ``myapp-stateboard`` section to ``/etc/tarantool/conf.d/myapp.yml``:
ru: Добавьте в конфигурацию ``/etc/tarantool/conf.d/myapp.yml`` раздел ``myapp-stateboard``:

source: Then start the stateboard service:
ru: Затем запустите сервис stateboard:
